CrawlingKingSn8ke/DSPi-ESP32-Front-Panel-Media-Player-SPDIF/firmware/DSPi_ESP32_Front_Panel_v1_1_2/MediaPlayerPoC.cpp
#include "MediaPlayerPoC.h"
#include "Mp3SeekPolicy.h"
#include "Mp3ArtworkPolicy.h"
#include "SpdifBlockEncoder.h"

#define DR_WAV_NO_STDIO
#define DR_WAV_IMPLEMENTATION
#define DR_FLAC_NO_STDIO
#define DR_FLAC_IMPLEMENTATION
#define DR_MP3_NO_STDIO
#define DR_MP3_IMPLEMENTATION
#include "third_party/dr_libs/dr_wav.h"
#include "third_party/dr_libs/dr_flac.h"
#include "third_party/dr_libs/dr_mp3.h"

#include <algorithm>
#include <climits>
#include <cstring>
#include <driver/i2s_std.h>
#include <esp_err.h>
#include <esp_heap_caps.h>
#include <esp_system.h>
#include <freertos/semphr.h>
#include <new>
#include <soc/soc_caps.h>

namespace {

// Playback uses a conservative shared-SPI clock with automatic lower-speed
// fallbacks for card compatibility.
constexpr uint32_t kSdFrequenciesHz[] = {
  20000000, 10000000, 4000000
};
constexpr uint8_t kSdMountAttemptsPerFrequency = 2;
constexpr uint32_t kSpiLockTimeoutMs = 2000;
constexpr size_t kMp3ScanLimit = 64 * 1024;
// Hold enough decoded PCM to ride through a clustered SD/FLAC latency burst.
// At 44.1 kHz these provide about 5.94 s, 2.97 s and 1.49 s of audio.
constexpr size_t kPreferredRingFrames = 262144;
constexpr size_t kFallbackRingFrames = 131072;
constexpr size_t kEmergencyRingFrames = 65536;
constexpr size_t kDecodeChunkFrames = 512;
constexpr size_t kOutputChunkFrames = 256;
constexpr uint64_t kMp3SeekYieldFrames = 1152ULL * 4ULL;
constexpr size_t kStartPrefillFrames = 16384;
constexpr size_t kSeekPrefillFrames = 8192;
constexpr uint32_t kMinimumPsramBandwidthTenthsMiB = 40;  // 4.0 MiB/s.
constexpr UBaseType_t kDecoderTaskPriority = 3;
constexpr UBaseType_t kOutputTaskPriority = 4;
// Keep the time-critical S/PDIF writer isolated on CPU1. Let decode/SD work use
// whichever CPU is available: output always preempts it on CPU1, while an idle
// CPU0 can absorb it between Bluetooth controller work. Automatic BLE scans
// are already suspended for active playback.
constexpr BaseType_t kDecoderTaskCore = tskNO_AFFINITY;
constexpr BaseType_t kOutputTaskCore = 1;
constexpr size_t kTailSilenceFrames = 512;
constexpr uint32_t kTaskStopTimeoutMs = 3000;
constexpr uint32_t kSeekQuiesceTimeoutMs = 750;
constexpr uint32_t kSeekPrefillTimeoutMs = 2500;
// Keep decoder I/O cooperative with the other front-panel tasks.
constexpr uint32_t kDecoderIoYieldIntervalMs = 20;
constexpr uint32_t kSlowDecoderCallMs = 100;
constexpr uint32_t kDecoderSlowReadThresholdMs = 100;
// dr_flac normally asks for 4 KiB. Keep that request contiguous so SdFat can
// issue a multi-sector read instead of four separately-arbitrated 1 KiB reads.
// Low-buffer UI guards bound shared-bus impact during abnormal card latency.
constexpr size_t kDecoderReadSliceBytes = 4096;
constexpr uint32_t kDecoderTaskStackBytes = 32768;
constexpr uint32_t kSeekMinimumFreeStackBytes = 8192;
constexpr EventBits_t kSeekActiveBit = BIT0;
constexpr EventBits_t kOutputQuiescentBit = BIT1;
constexpr EventBits_t kExternalHoldBit = BIT2;
constexpr size_t kArtworkMaximumBytes = 2 * 1024 * 1024;
constexpr uint32_t kMetadataMaximumBytes = 8 * 1024 * 1024;
constexpr size_t kArtworkReadChunkBytes = 2 * 1024;

static_assert((kPreferredRingFrames & (kPreferredRingFrames - 1)) == 0,
              "Preferred PCM ring frame count must be a power of two");
static_assert((kFallbackRingFrames & (kFallbackRingFrames - 1)) == 0,
              "Fallback PCM ring frame count must be a power of two");
static_assert((kEmergencyRingFrames & (kEmergencyRingFrames - 1)) == 0,
              "Emergency PCM ring frame count must be a power of two");
static_assert(kOutputTaskPriority > kDecoderTaskPriority,
              "S/PDIF output must always preempt media decoding");

SemaphoreHandle_t sharedSpiMutex()
{
  static SemaphoreHandle_t mutex = xSemaphoreCreateRecursiveMutex();
  return mutex;
}

class SharedSpiGuard {
public:
  SharedSpiGuard() { mediaSharedSpiLock(); }
  ~SharedSpiGuard() { mediaSharedSpiUnlock(); }
};

class TrySharedSpiGuard {
public:
  explicit TrySharedSpiGuard(uint32_t timeoutMs)
      : locked_(mediaSharedSpiTryLock(timeoutMs)) {}
  ~TrySharedSpiGuard() {
    if (locked_) mediaSharedSpiUnlock();
  }
  explicit operator bool() const { return locked_; }

  TrySharedSpiGuard(const TrySharedSpiGuard &) = delete;
  TrySharedSpiGuard &operator=(const TrySharedSpiGuard &) = delete;

private:
  bool locked_ = false;
};

uint16_t readLe16(const uint8_t *p)
{
  return (uint16_t)p[0] | ((uint16_t)p[1] << 8);
}

uint32_t readLe32(const uint8_t *p)
{
  return (uint32_t)p[0] |
         ((uint32_t)p[1] << 8) |
         ((uint32_t)p[2] << 16) |
         ((uint32_t)p[3] << 24);
}

uint32_t readBe32(const uint8_t *p)
{
  return ((uint32_t)p[0] << 24) |
         ((uint32_t)p[1] << 16) |
         ((uint32_t)p[2] << 8) |
         (uint32_t)p[3];
}

uint32_t readSynchsafe32(const uint8_t *p)
{
  return ((uint32_t)(p[0] & 0x7F) << 21) |
         ((uint32_t)(p[1] & 0x7F) << 14) |
         ((uint32_t)(p[2] & 0x7F) << 7) |
         (uint32_t)(p[3] & 0x7F);
}

bool readExact(MediaFsFile &file, uint8_t *buffer, size_t length)
{
  SharedSpiGuard guard;
  return file.read(buffer, length) == length;
}

bool nativeRateSupported(uint32_t sampleRate)
{
  return sampleRate == 44100 || sampleRate == 48000;
}

bool sourceDepthSupported(MediaFileFormat format, uint8_t bitsPerSample)
{
  return format == MediaFileFormat::Mp3 ||
         bitsPerSample == 16 || bitsPerSample == 24;
}

bool endsWithIgnoreCase(const char *text, const char *suffix)
{
  if (!text || !suffix) return false;
  size_t textLength = std::strlen(text);
  size_t suffixLength = std::strlen(suffix);
  if (suffixLength > textLength) return false;

  const char *candidate = text + textLength - suffixLength;
  for (size_t i = 0; i < suffixLength; i++) {
    char a = candidate[i];
    char b = suffix[i];
    if (a >= 'A' && a <= 'Z') a = (char)(a - 'A' + 'a');
    if (b >= 'A' && b <= 'Z') b = (char)(b - 'A' + 'a');
    if (a != b) return false;
  }
  return true;
}

MediaFileFormat formatFromPath(const char *path)
{
  if (endsWithIgnoreCase(path, ".wav")) return MediaFileFormat::Wav;
  if (endsWithIgnoreCase(path, ".flac")) return MediaFileFormat::Flac;
  if (endsWithIgnoreCase(path, ".mp3")) return MediaFileFormat::Mp3;
  return MediaFileFormat::Unknown;
}

