CrawlingKingSn8ke/DSPi-ESP32-Front-Panel-Media-Player-SPDIF/firmware/DSPi_ESP32_Front_Panel_v1_1_2/MediaPlayerPoC.cpp
int compareIgnoreCase(const char *a, const char *b)
{
  if (!a) a = "";
  if (!b) b = "";
  while (*a && *b) {
    char ca = *a++;
    char cb = *b++;
    if (ca >= 'A' && ca <= 'Z') ca = (char)(ca - 'A' + 'a');
    if (cb >= 'A' && cb <= 'Z') cb = (char)(cb - 'A' + 'a');
    if (ca != cb) return (unsigned char)ca - (unsigned char)cb;
  }
  return (unsigned char)*a - (unsigned char)*b;
}

void clearBrowserEntry(MediaBrowserEntry &entry)
{
  entry.path[0] = '\0';
  entry.name[0] = '\0';
  entry.directory = false;
  entry.format = MediaFileFormat::Unknown;
}

bool hiddenBrowserName(const char *name)
{
  if (!name || !name[0] || name[0] == '.') return true;
  return compareIgnoreCase(name, "System Volume Information") == 0;
}

int compareBrowserEntries(const MediaBrowserEntry &a,
                          const MediaBrowserEntry &b)
{
  if (a.directory != b.directory) return a.directory ? -1 : 1;
  int compared = compareIgnoreCase(a.name, b.name);
  if (compared != 0) return compared;
  compared = compareIgnoreCase(a.path, b.path);
  if (compared != 0) return compared;
  return std::strcmp(a.path, b.path);
}

// Insert one candidate into an ascending fixed-capacity page. First/next
// pages keep the smallest candidates after their anchor. Previous pages keep
// the largest candidates before their anchor. Memory therefore remains O(page
// size) no matter how many entries exist in the directory.
void insertBrowserPageCandidate(MediaBrowserEntry *entries, size_t &count,
                                size_t capacity,
                                const MediaBrowserEntry &candidate,
                                bool keepLargest)
{
  if (!entries || capacity == 0) return;

  if (count < capacity) {
    size_t position = count;
    while (position > 0 &&
           compareBrowserEntries(candidate, entries[position - 1]) < 0) {
      entries[position] = entries[position - 1];
      position--;
    }
    entries[position] = candidate;
    count++;
    return;
  }

  if (!keepLargest) {
    if (compareBrowserEntries(candidate, entries[count - 1]) >= 0) return;
    size_t position = count - 1;
    while (position > 0 &&
           compareBrowserEntries(candidate, entries[position - 1]) < 0) {
      entries[position] = entries[position - 1];
      position--;
    }
    entries[position] = candidate;
    return;
  }

  if (compareBrowserEntries(candidate, entries[0]) <= 0) return;
  size_t position = 1;
  while (position < count &&
         compareBrowserEntries(entries[position], candidate) < 0) {
    entries[position - 1] = entries[position];
    position++;
  }
  entries[position - 1] = candidate;
}

bool seekFile(MediaFsFile &file, int offset, int origin)
{
  SharedSpiGuard guard;
  int64_t base = 0;
  if (origin == 1) base = (int64_t)file.position();
  else if (origin == 2) base = (int64_t)file.size();
  else if (origin != 0) return false;

  int64_t target = base + offset;
  if (target < 0) return false;
  return file.seek((uint64_t)target);
}

bool readAt(MediaFsFile &file, uint64_t offset, uint8_t *buffer, size_t length)
{
  if (!buffer || length > UINT32_MAX ||
      offset > UINT64_MAX - (uint64_t)length) {
    return false;
  }
  SharedSpiGuard guard;
  return file.seek(offset) && file.read(buffer, length) == length;
}

bool artworkCancelled(const MediaArtworkControl *control)
{
  return control && control->cancelRequested &&
         control->cancelRequested(control->context);
}

bool waitForArtworkPermit(const MediaArtworkControl *control)
{
  if (artworkCancelled(control)) return false;
  if (control && control->waitForPermit &&
      !control->waitForPermit(control->context)) {
    return false;
  }
  return !artworkCancelled(control);
}

bool artworkReadAt(MediaFsFile &file, uint64_t offset, uint8_t *buffer,
                   size_t length, const MediaArtworkControl *control)
{
  return waitForArtworkPermit(control) &&
         readAt(file, offset, buffer, length);
}

uint64_t fileSizeLocked(MediaFsFile &file,
                        const MediaArtworkControl *control = nullptr)
{
  if (!waitForArtworkPermit(control)) return 0;
  SharedSpiGuard guard;
  return file.size();
}

// Locate the actual FLAC container after any leading ID3v2 tags. Some music
// tools write ID3 metadata ahead of a native FLAC stream. dr_flac recognises
// such tags while reading sequentially, but this vendored revision performs
// later absolute seeks relative to byte zero of the whole file. Presenting the
// decoder with a logical stream beginning at the FLAC/Ogg marker keeps every
// seek relative to the correct container start.
bool findFlacStreamOffset(MediaFsFile &file, uint64_t &streamOffset,
                          const MediaArtworkControl *control = nullptr)
{
  const uint64_t fileSize = fileSizeLocked(file, control);
  uint64_t cursor = 0;

  for (uint8_t tagIndex = 0; tagIndex < 8; tagIndex++) {
    if (cursor + 4 > fileSize) return false;

    uint8_t marker[4];
    if (!artworkReadAt(file, cursor, marker, sizeof(marker), control)) return false;
    if (std::memcmp(marker, "fLaC", 4) == 0 ||
        std::memcmp(marker, "OggS", 4) == 0) {
      streamOffset = cursor;
      return true;
    }

    if (std::memcmp(marker, "ID3", 3) != 0 || cursor + 10 > fileSize) {
      return false;
    }

    uint8_t header[10];
    if (!artworkReadAt(file, cursor, header, sizeof(header), control)) return false;
    for (uint8_t i = 6; i < 10; i++) {
      if (header[i] & 0x80) return false;
    }

    uint64_t payloadSize = readSynchsafe32(header + 6);
    uint64_t footerSize = (header[5] & 0x10) ? 10ULL : 0ULL;
    uint64_t next = cursor + 10ULL + payloadSize + footerSize;
    if (next <= cursor || next > fileSize) return false;
    cursor = next;
  }
  return false;
}

// Read the mandatory native-FLAC STREAMINFO block directly.  dr_flac remains
// the decoder, but the container header is the authoritative source for the
// stream rate/depth/channel contract used to configure DSPi.  This also gives
// us a useful cross-check if a decoder/library regression reports a different
// rate for an otherwise valid file.
bool readNativeFlacStreamInfo(MediaFsFile &file, uint64_t streamOffset,
                              MediaFileInfo &info)
{
  info = MediaFileInfo{};

  uint8_t marker[4] = {};
  uint8_t blockHeader[4] = {};
  uint8_t streamInfo[34] = {};
  if (!readAt(file, streamOffset, marker, sizeof(marker)) ||
      std::memcmp(marker, "fLaC", sizeof(marker)) != 0 ||
      !readAt(file, streamOffset + 4, blockHeader, sizeof(blockHeader))) {
    return false;
  }

