CrawlingKingSn8ke/DSPi-ESP32-Front-Panel-Media-Player-SPDIF/firmware/DSPi_ESP32_Front_Panel_v1_1_2/MediaPlayerPoC.cpp
  const uint8_t blockType = blockHeader[0] & 0x7F;
  const uint32_t blockLength = ((uint32_t)blockHeader[1] << 16) |
                               ((uint32_t)blockHeader[2] << 8) |
                               (uint32_t)blockHeader[3];
  if (blockType != 0 || blockLength != sizeof(streamInfo) ||
      !readAt(file, streamOffset + 8, streamInfo, sizeof(streamInfo))) {
    return false;
  }

  uint64_t packed = 0;
  for (uint8_t i = 10; i < 18; i++) {
    packed = (packed << 8) | streamInfo[i];
  }

  info.format = MediaFileFormat::Flac;
  info.sampleRate = (uint32_t)((packed >> 44) & 0xFFFFFULL);
  info.channels = (uint8_t)(((packed >> 41) & 0x07ULL) + 1ULL);
  info.bitsPerSample = (uint8_t)(((packed >> 36) & 0x1FULL) + 1ULL);
  info.totalFrames = packed & 0xFFFFFFFFFULL;
  info.valid = info.sampleRate > 0 && info.channels > 0 &&
               info.bitsPerSample > 0;
  info.nativeRateSupported = nativeRateSupported(info.sampleRate);
  return info.valid;
}

struct DecoderReadTelemetry {
  MediaPlaybackStats *stats = nullptr;
  uint32_t lastYieldAt = 0;
  bool ioErrorCounted = false;
};

struct DecoderIoContext {
  MediaFsFile *file = nullptr;
  volatile bool *cancelRequested = nullptr;
  DecoderReadTelemetry readTelemetry;
};

struct FlacStreamContext {
  MediaFsFile *file = nullptr;
  volatile bool *cancelRequested = nullptr;
  uint64_t baseOffset = 0;
  DecoderReadTelemetry readTelemetry;
};

void updateAtomicMaximum(uint32_t *target, uint32_t value)
{
  if (!target) return;
  uint32_t observed = __atomic_load_n(target, __ATOMIC_RELAXED);
  while (value > observed &&
         !__atomic_compare_exchange_n(target, &observed, value, false,
                                      __ATOMIC_RELAXED, __ATOMIC_RELAXED)) {}
}

void updateAtomicMinimum(uint32_t *target, uint32_t value)
{
  if (!target) return;
  uint32_t observed = __atomic_load_n(target, __ATOMIC_RELAXED);
  while (value < observed &&
         !__atomic_compare_exchange_n(target, &observed, value, false,
                                      __ATOMIC_RELAXED, __ATOMIC_RELAXED)) {}
}

size_t cooperativeDecoderRead(MediaFsFile *file,
                              volatile bool *cancelRequested,
                              DecoderReadTelemetry &telemetry,
                              void *output, size_t bytesToRead)
{
  if (!file || !*file || !output || bytesToRead == 0 ||
      (cancelRequested && *cancelRequested)) {
    return 0;
  }

  // Once an I/O error is reported, stop issuing reads from this decoder.
  if (file->hadIoError()) {
    if (telemetry.stats && !telemetry.ioErrorCounted) {
      __atomic_add_fetch(&telemetry.stats->sdReadErrors, 1U,
                         __ATOMIC_RELAXED);
      telemetry.ioErrorCounted = true;
    }
    if (telemetry.stats) {
      __atomic_add_fetch(&telemetry.stats->sdReadYields, 1U,
                         __ATOMIC_RELAXED);
    }
    vTaskDelay(1);
    telemetry.lastYieldAt = millis();
    return 0;
  }

  uint8_t *destination = static_cast<uint8_t *>(output);
  size_t totalRead = 0;
  const uint32_t callbackStartedAt = millis();

  while (totalRead < bytesToRead &&
         !(cancelRequested && *cancelRequested) && !file->hadIoError()) {
    const size_t sliceRequest =
        std::min(kDecoderReadSliceBytes, bytesToRead - totalRead);
    const uint32_t sliceStartedAt = millis();
    uint32_t transferStartedAt = sliceStartedAt;
    size_t sliceRead = 0;
    {
      SharedSpiGuard guard;
      transferStartedAt = millis();
      if (!(cancelRequested && *cancelRequested) && !file->hadIoError()) {
        sliceRead = file->read(destination + totalRead, sliceRequest);
      }
    }

    const uint32_t sliceFinishedAt = millis();
    const uint32_t spiWaitMs = transferStartedAt - sliceStartedAt;
    const uint32_t transferElapsedMs = sliceFinishedAt - transferStartedAt;
    const uint32_t sliceElapsedMs = sliceFinishedAt - sliceStartedAt;
    if (telemetry.stats) {
      __atomic_add_fetch(&telemetry.stats->sdReadSlices, 1U,
                         __ATOMIC_RELAXED);
      updateAtomicMaximum(&telemetry.stats->sdReadSliceMaxMs,
                          sliceElapsedMs);
      updateAtomicMaximum(&telemetry.stats->sdSpiWaitMaxMs, spiWaitMs);
      updateAtomicMaximum(&telemetry.stats->sdTransferMaxMs,
                          transferElapsedMs);
    }
    totalRead += sliceRead;

    const bool ioError = file->hadIoError();
    if (ioError && telemetry.stats && !telemetry.ioErrorCounted) {
      __atomic_add_fetch(&telemetry.stats->sdReadErrors, 1U,
                         __ATOMIC_RELAXED);
      telemetry.ioErrorCounted = true;
    }

    // Delay outside the shared-SPI guard after slow or failed reads, and at
    // regular intervals, so lower-priority system tasks can run.
    const uint32_t now = millis();
    if (ioError || sliceRead == 0 ||
        sliceElapsedMs >= kDecoderIoYieldIntervalMs ||
        (uint32_t)(now - telemetry.lastYieldAt) >=
            kDecoderIoYieldIntervalMs) {
      if (telemetry.stats) {
        __atomic_add_fetch(&telemetry.stats->sdReadYields, 1U,
                           __ATOMIC_RELAXED);
      }
      vTaskDelay(1);
      telemetry.lastYieldAt = millis();
    }

    if (sliceRead < sliceRequest || ioError) break;
  }

  const uint32_t callbackElapsedMs = millis() - callbackStartedAt;
  if (telemetry.stats) {
    __atomic_add_fetch(&telemetry.stats->sdReadCalls, 1U,
                       __ATOMIC_RELAXED);
    updateAtomicMaximum(&telemetry.stats->sdReadMaxMs, callbackElapsedMs);
    if (callbackElapsedMs >= kDecoderSlowReadThresholdMs) {
      __atomic_add_fetch(&telemetry.stats->sdSlowReads, 1U,
                         __ATOMIC_RELAXED);
    }
  }
  return totalRead;
}

struct ArtworkLocation {
  char path[MEDIA_FS_PATH_CAPACITY] = {0};
  uint32_t offset = 0;
  uint32_t length = 0;
  uint8_t pictureType = 0xFF;
};

bool setArtworkLocation(ArtworkLocation &location, const char *path,
                        uint64_t offset, uint64_t length,
                        uint8_t pictureType = 0xFF)
{
  if (!path || !path[0] || std::strlen(path) >= sizeof(location.path) ||
      length < 3 || length > kArtworkMaximumBytes ||
      offset > UINT32_MAX || offset + length > (uint64_t)UINT32_MAX + 1ULL) {
    return false;
  }
  strlcpy(location.path, path, sizeof(location.path));
  location.offset = (uint32_t)offset;
  location.length = (uint32_t)length;
  location.pictureType = pictureType;
  return true;
}

bool jpegSignatureAt(MediaFsFile &file, uint64_t offset,
                     const MediaArtworkControl *control)
{
  uint8_t signature[3];
  return artworkReadAt(file, offset, signature, sizeof(signature), control) &&
         signature[0] == 0xFF && signature[1] == 0xD8 &&
         signature[2] == 0xFF;
}

bool findEncodedTextEnd(MediaFsFile &file, uint64_t start, uint64_t end,
                        uint8_t encoding, uint64_t &afterTerminator,
                        const MediaArtworkControl *control)
{
  if (start >= end) return false;
  constexpr size_t kMaximumDescriptionBytes = 1024;
  size_t bytes = (size_t)std::min<uint64_t>(
      end - start, kMaximumDescriptionBytes);
  uint8_t text[kMaximumDescriptionBytes];
  if (!artworkReadAt(file, start, text, bytes, control)) return false;

  if (encoding == 0 || encoding == 3) {
    for (size_t i = 0; i < bytes; i++) {
      if (text[i] == 0) {
        afterTerminator = start + i + 1;
        return true;
      }
    }
    return false;
  }

  if (encoding == 1 || encoding == 2) {
    for (size_t i = 0; i + 1 < bytes; i += 2) {
      if (text[i] == 0 && text[i + 1] == 0) {
        afterTerminator = start + i + 2;
        return true;
      }
    }
  }
  return false;
}

bool locateId3ApicPayload(MediaFsFile &file, const char *path,
                          uint64_t frameStart, uint64_t frameSize,
                          bool id3v22, ArtworkLocation &location,
                          const MediaArtworkControl *control)
{
  uint64_t frameEnd = frameStart + frameSize;
  if (frameSize < (id3v22 ? 6U : 5U)) return false;

