CrawlingKingSn8ke/DSPi-ESP32-Front-Panel-Media-Player-SPDIF/firmware/DSPi_ESP32_Front_Panel_v1_1_2/MediaPlayerPoC.cpp
  uint8_t encoding = 0;
  if (!artworkReadAt(file, frameStart, &encoding, 1, control) ||
      encoding > 3) return false;

  uint64_t pictureTypePosition = 0;
  uint64_t descriptionStart = 0;
  if (id3v22) {
    uint8_t fixed[4];
    if (!artworkReadAt(file, frameStart + 1, fixed, sizeof(fixed), control))
      return false;
    pictureTypePosition = frameStart + 4;
    descriptionStart = frameStart + 5;
  } else {
    uint64_t mimeStart = frameStart + 1;
    size_t mimeBytes = (size_t)std::min<uint64_t>(frameEnd - mimeStart, 64);
    if (mimeBytes == 0) return false;
    uint8_t mime[64];
    if (!artworkReadAt(file, mimeStart, mime, mimeBytes, control)) return false;
    size_t terminator = 0;
    while (terminator < mimeBytes && mime[terminator] != 0) terminator++;
    if (terminator == mimeBytes) return false;
    pictureTypePosition = mimeStart + terminator + 1;
    descriptionStart = pictureTypePosition + 1;
  }

  if (descriptionStart >= frameEnd) return false;
  uint8_t pictureType = 0xFF;
  if (!artworkReadAt(file, pictureTypePosition, &pictureType, 1, control))
    return false;

  uint64_t imageStart = 0;
  if (!findEncodedTextEnd(file, descriptionStart, frameEnd, encoding,
                          imageStart, control) ||
      imageStart >= frameEnd) {
    return false;
  }
  uint64_t imageLength = frameEnd - imageStart;
  if (imageLength > kArtworkMaximumBytes ||
      !jpegSignatureAt(file, imageStart, control)) {
    return false;
  }
  return setArtworkLocation(location, path, imageStart, imageLength,
                            pictureType);
}

bool locateMp3Artwork(MediaFsFile &file, const char *path,
                      ArtworkLocation &location,
                      const MediaArtworkControl *control)
{
  uint64_t fileSize = fileSizeLocked(file, control);
  uint8_t tagHeader[10];
  if (fileSize < sizeof(tagHeader) ||
      !artworkReadAt(file, 0, tagHeader, sizeof(tagHeader), control) ||
      std::memcmp(tagHeader, "ID3", 3) != 0) {
    return false;
  }

  const Mp3ArtworkPolicy::Id3TagInfo tag =
      Mp3ArtworkPolicy::inspectId3TagHeader(
          tagHeader, sizeof(tagHeader), fileSize, kMetadataMaximumBytes);
  if (tag.status != Mp3ArtworkPolicy::Id3TagStatus::Valid) return false;

  const uint8_t version = tag.version;
  const uint64_t tagEnd = tag.tagEnd;

  uint64_t cursor = 10;
  if (version >= 3 && (tagHeader[5] & 0x40)) {
    uint8_t sizeBytes[4];
    if (!artworkReadAt(file, cursor, sizeBytes, sizeof(sizeBytes), control))
      return false;
    uint32_t extendedSize = version == 4
                                ? readSynchsafe32(sizeBytes)
                                : readBe32(sizeBytes);
    uint64_t skip = version == 4 ? extendedSize : 4ULL + extendedSize;
    if (skip < 4 || cursor + skip > tagEnd) return false;
    cursor += skip;
  }

  ArtworkLocation fallback;
  for (uint16_t frameIndex = 0; frameIndex < 512 && cursor < tagEnd;
       frameIndex++) {
    bool id3v22 = version == 2;
    size_t headerSize = id3v22 ? 6 : 10;
    if (cursor + headerSize > tagEnd) break;

    uint8_t frameHeader[10] = {};
    if (!artworkReadAt(file, cursor, frameHeader, headerSize, control)) break;
    if (frameHeader[0] == 0) break;

    bool apic = id3v22
                    ? std::memcmp(frameHeader, "PIC", 3) == 0
                    : std::memcmp(frameHeader, "APIC", 4) == 0;
    uint32_t frameSize = id3v22
                             ? ((uint32_t)frameHeader[3] << 16) |
                                   ((uint32_t)frameHeader[4] << 8) |
                                   frameHeader[5]
                             : (version == 4
                                    ? readSynchsafe32(frameHeader + 4)
                                    : readBe32(frameHeader + 4));
    if (version == 4) {
      for (uint8_t i = 4; i < 8; i++) {
        if (frameHeader[i] & 0x80) return false;
      }
    }

    uint64_t frameStart = cursor + headerSize;
    uint64_t next = frameStart + frameSize;
    if (frameSize == 0 || next > tagEnd) break;

    bool transformed = false;
    if (!id3v22 && version == 3) {
      transformed = (frameHeader[9] & 0xE0) != 0;
    } else if (!id3v22 && version == 4) {
      transformed = (frameHeader[9] & 0x4F) != 0;
    }

    if (apic && !transformed) {
      ArtworkLocation candidate;
      if (locateId3ApicPayload(file, path, frameStart, frameSize,
                               id3v22, candidate, control)) {
        if (candidate.pictureType == 3) {
          location = candidate;
          return true;
        }
        if (!fallback.length) fallback = candidate;
      }
    }
    cursor = next;
  }

  if (fallback.length) {
    location = fallback;
    return true;
  }
  return false;
}

bool locateFlacPicturePayload(MediaFsFile &file, const char *path,
                              uint64_t blockStart, uint32_t blockLength,
                              ArtworkLocation &location,
                              const MediaArtworkControl *control)
{
  uint64_t blockEnd = blockStart + blockLength;
  uint64_t cursor = blockStart;
  uint8_t number[4];

  if (blockLength < 32 ||
      !artworkReadAt(file, cursor, number, 4, control)) return false;
  uint8_t pictureType = (uint8_t)std::min<uint32_t>(readBe32(number), 0xFF);
  cursor += 4;

  if (!artworkReadAt(file, cursor, number, 4, control)) return false;
  uint32_t mimeLength = readBe32(number);
  cursor += 4;
  if (cursor + mimeLength + 4 > blockEnd) return false;
  cursor += mimeLength;

  if (!artworkReadAt(file, cursor, number, 4, control)) return false;
  uint32_t descriptionLength = readBe32(number);
  cursor += 4;
  if (cursor + descriptionLength + 20 > blockEnd) return false;
  cursor += descriptionLength;

  // Width, height, depth and indexed-colour count.
  cursor += 16;
  if (!artworkReadAt(file, cursor, number, 4, control)) return false;
  uint32_t imageLength = readBe32(number);
  cursor += 4;
  if (imageLength < 3 || imageLength > kArtworkMaximumBytes ||
      cursor + imageLength > blockEnd ||
      !jpegSignatureAt(file, cursor, control)) {
    return false;
  }
  return setArtworkLocation(location, path, cursor, imageLength,
                            pictureType);
}

bool locateFlacArtwork(MediaFsFile &file, const char *path,
                       ArtworkLocation &location,
                       const MediaArtworkControl *control)
{
  uint64_t fileSize = fileSizeLocked(file, control);
  uint64_t cursor = 0;
  uint8_t signature[4];
  if (!findFlacStreamOffset(file, cursor, control) ||
      cursor + 4 > fileSize ||
      !artworkReadAt(file, cursor, signature, sizeof(signature), control) ||
      std::memcmp(signature, "fLaC", 4) != 0) {
    return false;
  }
  cursor += 4;

  ArtworkLocation fallback;
  for (uint8_t blockIndex = 0; blockIndex < 64 && cursor + 4 <= fileSize;
       blockIndex++) {
    uint8_t blockHeader[4];
    if (!artworkReadAt(file, cursor, blockHeader, sizeof(blockHeader), control))
      break;
    bool last = (blockHeader[0] & 0x80) != 0;
    uint8_t type = blockHeader[0] & 0x7F;
    uint32_t blockLength = ((uint32_t)blockHeader[1] << 16) |
                           ((uint32_t)blockHeader[2] << 8) |
                           blockHeader[3];
    uint64_t blockStart = cursor + 4;
    uint64_t next = blockStart + blockLength;
    if (next > fileSize) return false;

