CrawlingKingSn8ke/DSPi-ESP32-Front-Panel-Media-Player-SPDIF/firmware/DSPi_ESP32_Front_Panel_v1_1_2/MediaPlayerPoC.cpp
    if (type == 6) {
      ArtworkLocation candidate;
      if (locateFlacPicturePayload(file, path, blockStart, blockLength,
                                   candidate, control)) {
        if (candidate.pictureType == 3) {
          location = candidate;
          return true;
        }
        if (!fallback.length) fallback = candidate;
      }
    }
    cursor = next;
    if (last) break;
  }

  if (fallback.length) {
    location = fallback;
    return true;
  }
  return false;
}

bool buildSiblingPath(const char *audioPath, const char *fileName,
                      char *output, size_t outputSize)
{
  if (!audioPath || !fileName || !output || outputSize == 0) return false;
  const char *slash = std::strrchr(audioPath, '/');
  size_t directoryLength = slash ? (size_t)(slash - audioPath) : 0;
  int written = 0;
  if (!slash || directoryLength == 0) {
    written = snprintf(output, outputSize, "/%s", fileName);
  } else {
    written = snprintf(output, outputSize, "%.*s/%s",
                       (int)directoryLength, audioPath, fileName);
  }
  return written > 0 && (size_t)written < outputSize;
}

bool locateFolderArtwork(const char *audioPath, ArtworkLocation &location,
                         const MediaArtworkControl *control)
{
  static const char *const candidates[] = {
      "cover.jpg", "Cover.jpg", "folder.jpg", "Folder.jpg",
      "cover.jpeg", "Cover.jpeg"};
  for (const char *candidateName : candidates) {
    if (!waitForArtworkPermit(control)) return false;
    char candidatePath[MEDIA_FS_PATH_CAPACITY];
    if (!buildSiblingPath(audioPath, candidateName, candidatePath,
                          sizeof(candidatePath))) {
      continue;
    }

    SharedSpiGuard guard;
    MediaFsFile file = mediaFs.open(candidatePath);
    if (!file || file.isDirectory()) {
      if (file) file.close();
      continue;
    }
    uint64_t size = file.size();
    uint8_t signature[3] = {};
    bool jpeg = size >= sizeof(signature) &&
                size <= kArtworkMaximumBytes &&
                file.seek(0) &&
                file.read(signature, sizeof(signature)) == sizeof(signature) &&
                signature[0] == 0xFF && signature[1] == 0xD8 &&
                signature[2] == 0xFF;
    file.close();
    if (jpeg && setArtworkLocation(location, candidatePath, 0, size)) {
      return true;
    }
  }
  return false;
}

bool readArtworkLocation(const ArtworkLocation &location, uint8_t **data,
                         size_t *length,
                         const MediaArtworkControl *control)
{
  if (!data || !length || !location.length) return false;
  *data = nullptr;
  *length = 0;

  uint8_t *buffer = static_cast<uint8_t *>(heap_caps_malloc(
      location.length, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));
  if (!buffer) {
    buffer = static_cast<uint8_t *>(
        heap_caps_malloc(location.length, MALLOC_CAP_8BIT));
  }
  if (!buffer) return false;

  MediaFsFile artworkFile;
  bool artworkOpen = false;
  uint64_t artworkFileSize = 0;
  {
    if (!waitForArtworkPermit(control)) {
      heap_caps_free(buffer);
      return false;
    }
    SharedSpiGuard guard;
    artworkFile = mediaFs.open(location.path);
    artworkOpen = artworkFile && !artworkFile.isDirectory();
    if (artworkOpen) artworkFileSize = artworkFile.size();
  }
  if (!artworkOpen ||
      (uint64_t)location.offset + location.length > artworkFileSize) {
    if (artworkFile) {
      SharedSpiGuard guard;
      artworkFile.close();
    }
    heap_caps_free(buffer);
    return false;
  }

  size_t copied = 0;
  while (copied < location.length) {
    size_t chunk = std::min(kArtworkReadChunkBytes,
                            (size_t)location.length - copied);
    if (!artworkReadAt(artworkFile,
                       (uint64_t)location.offset + copied,
                       buffer + copied, chunk, control)) {
      break;
    }
    copied += chunk;
    vTaskDelay(1);
  }
  {
    SharedSpiGuard guard;
    artworkFile.close();
  }

  if (copied != location.length ||
      buffer[0] != 0xFF || buffer[1] != 0xD8 || buffer[2] != 0xFF) {
    heap_caps_free(buffer);
    return false;
  }

  *data = buffer;
  *length = location.length;
  return true;
}

size_t decoderRead(void *context, void *output, size_t bytesToRead)
{
  DecoderIoContext *io = static_cast<DecoderIoContext *>(context);
  if (!io) return 0;
  return cooperativeDecoderRead(io->file, io->cancelRequested,
                                io->readTelemetry, output, bytesToRead);
}

drwav_bool32 wavSeek(void *context, int offset, drwav_seek_origin origin)
{
  DecoderIoContext *io = static_cast<DecoderIoContext *>(context);
  if (!io || !io->file || !*io->file ||
      (io->cancelRequested && *io->cancelRequested)) {
    return DRWAV_FALSE;
  }
  return seekFile(*io->file, offset, (int)origin)
             ? DRWAV_TRUE : DRWAV_FALSE;
}

drwav_bool32 wavTell(void *context, drwav_int64 *cursor)
{
  DecoderIoContext *io = static_cast<DecoderIoContext *>(context);
  if (!io || !io->file || !*io->file || !cursor ||
      (io->cancelRequested && *io->cancelRequested)) {
    return DRWAV_FALSE;
  }
  SharedSpiGuard guard;
  *cursor = (drwav_int64)io->file->position();
  return DRWAV_TRUE;
}

size_t flacRead(void *context, void *output, size_t bytesToRead)
{
  FlacStreamContext *stream = static_cast<FlacStreamContext *>(context);
  if (!stream) return 0;
  return cooperativeDecoderRead(stream->file, stream->cancelRequested,
                                stream->readTelemetry, output, bytesToRead);
}

drflac_bool32 flacSeek(void *context, int offset, drflac_seek_origin origin)
{
  FlacStreamContext *stream = static_cast<FlacStreamContext *>(context);
  if (!stream || !stream->file || !*stream->file ||
      (stream->cancelRequested && *stream->cancelRequested)) {
    return DRFLAC_FALSE;
  }

  SharedSpiGuard guard;
  if (stream->cancelRequested && *stream->cancelRequested) return DRFLAC_FALSE;
  int64_t base = 0;
  if (origin == DRFLAC_SEEK_SET) {
    base = (int64_t)stream->baseOffset;
  } else if (origin == DRFLAC_SEEK_CUR) {
    base = (int64_t)stream->file->position();
  } else if (origin == DRFLAC_SEEK_END) {
    base = (int64_t)stream->file->size();
  } else {
    return DRFLAC_FALSE;
  }

  int64_t target = base + (int64_t)offset;
  if (target < (int64_t)stream->baseOffset ||
      (uint64_t)target > stream->file->size()) {
    return DRFLAC_FALSE;
  }
  return stream->file->seek((uint64_t)target) ? DRFLAC_TRUE : DRFLAC_FALSE;
}

drflac_bool32 flacTell(void *context, drflac_int64 *cursor)
{
  FlacStreamContext *stream = static_cast<FlacStreamContext *>(context);
  if (!stream || !stream->file || !*stream->file || !cursor ||
      (stream->cancelRequested && *stream->cancelRequested)) {
    return DRFLAC_FALSE;
  }

  SharedSpiGuard guard;
  if (stream->cancelRequested && *stream->cancelRequested) return DRFLAC_FALSE;
  uint64_t physical = stream->file->position();
  if (physical < stream->baseOffset) return DRFLAC_FALSE;
  *cursor = (drflac_int64)(physical - stream->baseOffset);
  return DRFLAC_TRUE;
}

// Open the decoder on a logical stream that begins at the real native FLAC or
// Ogg FLAC marker. This makes probing and playback agree and fixes valid files
// carrying a leading ID3v2 tag.
drflac *openFlacStream(MediaFsFile &file, FlacStreamContext &stream)
{
  uint64_t baseOffset = 0;
  if (!findFlacStreamOffset(file, baseOffset)) return nullptr;

