CrawlingKingSn8ke/DSPi-ESP32-Front-Panel-Media-Player-SPDIF/firmware/DSPi_ESP32_Front_Panel_v1_1_2/MediaPlayerPoC.cpp
  stream.file = &file;
  stream.baseOffset = baseOffset;
  {
    SharedSpiGuard guard;
    if (!file.seek(baseOffset)) return nullptr;
  }
  return drflac_open(flacRead, flacSeek, flacTell, &stream, nullptr);
}

drmp3_bool32 mp3Seek(void *context, int offset, drmp3_seek_origin origin)
{
  DecoderIoContext *io = static_cast<DecoderIoContext *>(context);
  if (!io || !io->file || !*io->file ||
      (io->cancelRequested && *io->cancelRequested)) {
    return DRMP3_FALSE;
  }
  return seekFile(*io->file, offset, (int)origin)
             ? DRMP3_TRUE : DRMP3_FALSE;
}

drmp3_bool32 mp3Tell(void *context, drmp3_int64 *cursor)
{
  DecoderIoContext *io = static_cast<DecoderIoContext *>(context);
  if (!io || !io->file || !*io->file || !cursor ||
      (io->cancelRequested && *io->cancelRequested)) {
    return DRMP3_FALSE;
  }
  SharedSpiGuard guard;
  *cursor = (drmp3_int64)io->file->position();
  return DRMP3_TRUE;
}

}  // namespace

void mediaSharedSpiLock()
{
  SemaphoreHandle_t mutex = sharedSpiMutex();
  while (!mutex) {
    vTaskDelay(pdMS_TO_TICKS(10));
    mutex = sharedSpiMutex();
  }

  // The LCD and SD card share one SPI bus. Wait cooperatively rather than
  // restarting the panel on normal contention. Media tasks are never forcibly
  // deleted, so a task cannot be abandoned while it owns this recursive mutex.
  uint32_t waits = 0;
  while (xSemaphoreTakeRecursive(mutex, pdMS_TO_TICKS(kSpiLockTimeoutMs)) !=
         pdTRUE) {
    waits++;
    Serial.printf("MEDIA SPI: waiting for shared bus (%lu ms)\n",
                  (unsigned long)(waits * kSpiLockTimeoutMs));
    vTaskDelay(pdMS_TO_TICKS(2));
  }
}

bool mediaSharedSpiTryLock(uint32_t timeoutMs)
{
  SemaphoreHandle_t mutex = sharedSpiMutex();
  if (!mutex) return false;
  TickType_t ticks = timeoutMs ? pdMS_TO_TICKS(timeoutMs) : 0;
  return xSemaphoreTakeRecursive(mutex, ticks) == pdTRUE;
}

void mediaSharedSpiUnlock()
{
  SemaphoreHandle_t mutex = sharedSpiMutex();
  if (mutex) xSemaphoreGiveRecursive(mutex);
}

struct MediaPlayerPoC::SeekCommand {
  uint64_t targetFrame = 0;
  uint32_t generation = 0;
  bool resumePaused = false;
};

enum class MediaPlayerPoC::Mp3SeekAttemptResult : uint8_t {
  Completed = 0,
  Timeout,
  Stopped,
  Superseded,
  DecodeFailure,
  HeapIntegrityFailure,
  OpenFailure,
  AllocationFailure,
  PrefillFailure
};

struct MediaPlayerPoC::Mp3SeekAttempt {
  Mp3SeekAttemptResult result = Mp3SeekAttemptResult::DecodeFailure;
  uint64_t framesScanned = 0;
  uint32_t elapsedMs = 0;
};

struct MediaPlayerPoC::DecoderState {
  MediaFsFile file;
  DecoderIoContext io;
  FlacStreamContext flacStream;
  drwav wav = {};
  drflac *flac = nullptr;
  drmp3 mp3 = {};
  bool wavOpen = false;
  bool mp3Open = false;
  drwav_int32 s32[kDecodeChunkFrames * 2] = {};
  drmp3_int16 s16[kDecodeChunkFrames * 2] = {};
  int32_t stereo[kDecodeChunkFrames * 2] = {};
};

bool MediaPlayerPoC::begin(SPIClass &spi, int8_t chipSelectPin, int8_t clockPin,
                           int8_t misoPin, int8_t mosiPin)
{
  if (!seekCommandQueue) {
    seekCommandQueue = xQueueCreate(1, sizeof(SeekCommand));
  }
  if (!seekEventQueue) {
    seekEventQueue = xQueueCreate(1, sizeof(MediaSeekEvent));
  }
  if (!mediaControlEvents) {
    mediaControlEvents = xEventGroupCreate();
  }
  if (!seekCommandQueue || !seekEventQueue || !mediaControlEvents) {
    Serial.println("MEDIA INIT: control allocation failed");
    return false;
  }

  mediaSpi = &spi;
  mediaChipSelectPin = chipSelectPin;
  mediaClockPin = clockPin;
  mediaMisoPin = misoPin;
  mediaMosiPin = mosiPin;
  xQueueReset(seekCommandQueue);
  xQueueReset(seekEventQueue);
  xEventGroupClearBits(mediaControlEvents,
                       kSeekActiveBit | kOutputQuiescentBit |
                       kExternalHoldBit);
  suppressSpdifTimeoutsUntil = 0;

  // Media subsystem initialisation is deliberately separate from card mount.
  // A full-flash reset is only a warm reset for the separately powered SD card;
  // touching it under the boot logo made the first boot depend on peripheral
  // timing. Keep both chip selects inactive and mount only when Media is opened.
  pinMode(mediaChipSelectPin, OUTPUT);
  digitalWrite(mediaChipSelectPin, HIGH);
  cardMounted = false;
  mountedCardType = MEDIA_CARD_NONE;
  mountedCardSizeBytes = 0;
  mountedFrequencyHz = 0;
  Serial.println("MEDIA INIT: ready; SD mount deferred until Media selection");
  return true;
}

bool MediaPlayerPoC::mountCard(uint32_t lockTimeoutMs)
{
  return mountCardWithMode(MediaFsAccessMode::NormalReadOnly,
                           lockTimeoutMs);
}

bool MediaPlayerPoC::mountCardForTransfer(uint32_t lockTimeoutMs)
{
  return mountCardWithMode(MediaFsAccessMode::TransferReadWrite,
                           lockTimeoutMs);
}

bool MediaPlayerPoC::switchMountedCardAccessMode(
    MediaFsAccessMode accessMode, uint32_t lockTimeoutMs)
{
  if (accessMode == MediaFsAccessMode::Unmounted || !cardMounted ||
      !mediaFs.mounted()) {
    return false;
  }
  if (state != MediaPlaybackState::Stopped || decoder ||
      decoderTaskHandle || outputTaskHandle) {
    Serial.println(
        "MEDIA SD: access-mode switch rejected; playback resources active");
    return false;
  }

  TrySharedSpiGuard guard(lockTimeoutMs);
  if (!guard) {
    Serial.printf(
        "MEDIA SD: access-mode switch deferred; shared SPI busy timeout=%lu ms\n",
        static_cast<unsigned long>(lockTimeoutMs));
    return false;
  }

  const bool directoryWasOpen = static_cast<bool>(browserDirectoryScratch);
  const bool entryWasOpen = static_cast<bool>(browserEntryScratch);
  browserDirectoryScratch.close();
  browserEntryScratch.close();

  const bool usable = mediaFs.mountedCardUsable();
  if (!usable || !mediaFs.setAccessMode(accessMode)) {
    Serial.println("MEDIA SD: access-mode switch rejected; mount invalid");
    return false;
  }

  Serial.printf(
      "MEDIA SD: access mode switched to=%s browser_dir=%s browser_entry=%s\n",
      accessMode == MediaFsAccessMode::TransferReadWrite
          ? "transfer-rw" : "normal-ro",
      directoryWasOpen ? "closed" : "idle",
      entryWasOpen ? "closed" : "idle");
  return true;
}

bool MediaPlayerPoC::unmountCard(uint32_t lockTimeoutMs)
{
  if (state != MediaPlaybackState::Stopped || decoder ||
      decoderTaskHandle || outputTaskHandle) {
    Serial.println("MEDIA SD: unmount rejected; playback resources active");
    return false;
  }

  // Never block loopTask indefinitely while the LCD/artwork task owns the
  // shared SPI bus.  The Wi-Fi lifecycle retries this bounded operation and
  // keeps the display responsive until every SD user has released the bus.
  if (!mediaSharedSpiTryLock(lockTimeoutMs)) {
    Serial.printf("MEDIA SD: unmount deferred; shared SPI busy timeout=%lu ms\n",
                  static_cast<unsigned long>(lockTimeoutMs));
    return false;
  }

  const bool directoryWasOpen = static_cast<bool>(browserDirectoryScratch);
  const bool entryWasOpen = static_cast<bool>(browserEntryScratch);
  browserDirectoryScratch.close();
  browserEntryScratch.close();
  mediaFs.end();
  mediaSharedSpiUnlock();

  cardMounted = false;
  mountedCardType = MEDIA_CARD_NONE;
  mountedCardSizeBytes = 0;
  mountedFrequencyHz = 0;
  Serial.printf("MEDIA SD: unmount complete browser_dir=%s browser_entry=%s\n",
                directoryWasOpen ? "closed" : "idle",
                entryWasOpen ? "closed" : "idle");
  return true;
}

bool MediaPlayerPoC::prepareCardForControllerRestart(
    uint32_t lockTimeoutMs)
{
  if (state != MediaPlaybackState::Stopped || decoder ||
      decoderTaskHandle || outputTaskHandle) {
    Serial.println(
        "MEDIA SD: restart preparation rejected; playback resources active");
    return false;
  }
  if (!mediaSpi || mediaChipSelectPin < 0 || mediaClockPin < 0 ||
      mediaMisoPin < 0 || mediaMosiPin < 0) {
    Serial.println(
        "MEDIA SD: restart preparation rejected; media bus unavailable");
    return false;
  }
  if (!mediaSharedSpiTryLock(lockTimeoutMs)) {
    Serial.printf(
        "MEDIA SD: restart preparation deferred; shared SPI busy timeout=%lu ms\n",
        static_cast<unsigned long>(lockTimeoutMs));
    return false;
  }

