CrawlingKingSn8ke/DSPi-ESP32-Front-Panel-Media-Player-SPDIF/firmware/DSPi_ESP32_Front_Panel_v1_1_2/MediaPlayerPoC.cpp
  browserDirectoryScratch.close();
  browserEntryScratch.close();
  mediaFs.end();

  SPIClass &spi = *mediaSpi;
  pinMode(mediaChipSelectPin, OUTPUT);
  digitalWrite(mediaChipSelectPin, HIGH);

  // Give a still-powered card a complete idle train before the ESP32 resets.
  // The v13.2.1 hardware trace showed ACMD41 error 0x17 after a warm restart
  // when the mounted card was left live across ESP.restart().
  spi.beginTransaction(SPISettings(400000, MSBFIRST, SPI_MODE0));
  for (uint8_t clockByte = 0; clockByte < 32U; ++clockByte) {
    spi.transfer(0xFF);
  }
  spi.endTransaction();
  delay(2);
  spi.end();

  // Hold the bus in the SD SPI idle state until ROM/startup code takes over.
  pinMode(mediaClockPin, OUTPUT);
  digitalWrite(mediaClockPin, LOW);
  pinMode(mediaMosiPin, OUTPUT);
  digitalWrite(mediaMosiPin, HIGH);
  pinMode(mediaMisoPin, INPUT_PULLUP);
  digitalWrite(mediaChipSelectPin, HIGH);

  cardMounted = false;
  mountedCardType = MEDIA_CARD_NONE;
  mountedCardSizeBytes = 0;
  mountedFrequencyHz = 0;
  mediaSharedSpiUnlock();
  Serial.println(
      "MEDIA SD: prepared for controller restart; filesystem closed SPI idle");
  return true;
}

bool MediaPlayerPoC::mountCardWithMode(MediaFsAccessMode accessMode,
                                       uint32_t lockTimeoutMs)
{
  if (accessMode == MediaFsAccessMode::Unmounted) return false;

  // Normal browsing and transfer writing use the same SdFs instance.  The
  // access mode is an application-level ownership gate, so a healthy mounted
  // card can change owner without spi.end()/spi.begin().  This avoids the
  // hardware freeze observed when a full-screen LCD DMA flush was followed by
  // an immediate SPI peripheral restart after browsing an album.
  if (cardMounted && mediaFs.mounted()) {
    TrySharedSpiGuard guard(lockTimeoutMs);
    if (!guard) {
      Serial.println("MEDIA SD: mounted mode switch deferred; shared SPI busy");
      return false;
    }
    browserDirectoryScratch.close();
    browserEntryScratch.close();
    const bool stillUsable = mediaFs.mountedCardUsable();
    if (stillUsable && mediaFs.setAccessMode(accessMode)) {
      Serial.printf("MEDIA SD: reused mounted card access=%s\n",
                    accessMode == MediaFsAccessMode::TransferReadWrite
                        ? "transfer-rw" : "normal-ro");
      return true;
    }

    Serial.println("MEDIA SD: cached mount invalid; remounting");
    mediaFs.end();
    cardMounted = false;
    mountedCardType = MEDIA_CARD_NONE;
    mountedCardSizeBytes = 0;
    mountedFrequencyHz = 0;
  }
  if (!cardMounted && mediaFs.mounted() && storageIoFault) {
    // A decoder-side I/O fault is not a deliberate unmount. Keep the panel
    // responsive, quarantine the stale mount and request a full power cycle.
    browserDirectoryScratch.close();
    browserEntryScratch.close();
    strlcpy(errorText, "SD read fault; power cycle required",
            sizeof(errorText));
    Serial.printf(
        "MEDIA SD: faulted mount quarantined clock=%lu Hz code=0x%02X "
        "data=0x%08lX; power cycle required\n",
        static_cast<unsigned long>(mountedFrequencyHz),
        static_cast<unsigned>(mediaFs.errorCode()),
        static_cast<unsigned long>(mediaFs.errorData()));
    return false;
  }
  if (!cardMounted && mediaFs.mounted()) {
    TrySharedSpiGuard guard(lockTimeoutMs);
    if (!guard) {
      Serial.println("MEDIA SD: stale mount release deferred; shared SPI busy");
      return false;
    }
    browserDirectoryScratch.close();
    browserEntryScratch.close();
    mediaFs.end();
  }
  if (!mediaSpi || mediaChipSelectPin < 0 || mediaClockPin < 0 ||
      mediaMisoPin < 0 || mediaMosiPin < 0) {
    Serial.println("MEDIA SD: mount rejected; media subsystem not initialized");
    return false;
  }

  TrySharedSpiGuard guard(lockTimeoutMs);
  if (!guard) {
    Serial.println("MEDIA SD: mount deferred; shared SPI busy");
    return false;
  }
  SPIClass &spi = *mediaSpi;
  const int8_t chipSelectPin = mediaChipSelectPin;
  cardMounted = false;
  mountedCardType = MEDIA_CARD_NONE;
  mountedCardSizeBytes = 0;
  mountedFrequencyHz = 0;

  // The LCD and SD share the bus. Every attempt starts from a known deselected
  // state, clocks the card idle at 400 kHz, and then lets SdFat negotiate.
  // This path is user-initiated and never delays the boot logo.
  for (uint32_t frequencyHz : kSdFrequenciesHz) {
    for (uint8_t attempt = 0; attempt < kSdMountAttemptsPerFrequency; attempt++) {
      mediaFs.end();
      pinMode(chipSelectPin, OUTPUT);
      digitalWrite(chipSelectPin, HIGH);
      spi.end();
      delay(attempt == 0 ? 20 : 80);
      spi.begin(mediaClockPin, mediaMisoPin, mediaMosiPin, chipSelectPin);

      spi.beginTransaction(SPISettings(400000, MSBFIRST, SPI_MODE0));
      digitalWrite(chipSelectPin, HIGH);
      for (uint8_t clockByte = 0; clockByte < 16; clockByte++) {
        spi.transfer(0xFF);
      }
      spi.endTransaction();
      delay(attempt == 0 ? 40 : 140);

      Serial.printf("MEDIA SD: mount attempt frequency=%lu Hz try=%u/%u\n",
                    (unsigned long)frequencyHz, (unsigned)(attempt + 1),
                    (unsigned)kSdMountAttemptsPerFrequency);
      if (!mediaFs.begin(chipSelectPin, spi, frequencyHz, "/sd", 8, false,
                         accessMode)) {
        Serial.printf(
            "MEDIA SD: mount failed frequency=%lu Hz code=0x%02X "
            "data=0x%08lX\n",
            (unsigned long)frequencyHz, (unsigned)mediaFs.errorCode(),
            (unsigned long)mediaFs.errorData());
        continue;
      }

      mountedCardType = mediaFs.cardType();
      mountedCardSizeBytes = mediaFs.cardSize();
      if (mountedCardType != MEDIA_CARD_NONE && mountedCardSizeBytes > 0) {
        cardMounted = true;
        mountedFrequencyHz = frequencyHz;
        Serial.printf("MEDIA SD: mount complete access=%s\n",
                      accessMode == MediaFsAccessMode::TransferReadWrite
                          ? "transfer-rw" : "normal-ro");
        return true;
      }

