CrawlingKingSn8ke/DSPi-ESP32-Front-Panel-Media-Player-SPDIF/firmware/DSPi_ESP32_Front_Panel_v1_1_2/MediaPlayerPoC.cpp
      Serial.printf("MEDIA SD: card recognised but metadata invalid "
                    "type=%u size=%llu\n",
                    (unsigned)mountedCardType,
                    (unsigned long long)mountedCardSizeBytes);
      mediaFs.end();
      mountedCardType = MEDIA_CARD_NONE;
      mountedCardSizeBytes = 0;
    }
  }

  mediaFs.end();
  pinMode(chipSelectPin, OUTPUT);
  digitalWrite(chipSelectPin, HIGH);
  spi.begin(mediaClockPin, mediaMisoPin, mediaMosiPin, chipSelectPin);
  Serial.println("MEDIA SD: no usable card after bounded mount attempts");
  return false;
}


bool MediaPlayerPoC::prepareAudioBuffer()
{
  return allocateRing();
}

bool MediaPlayerPoC::mounted() const
{
  return cardMounted;
}

MediaFsAccessMode MediaPlayerPoC::cardAccessMode() const
{
  return mediaFs.accessMode();
}

void MediaPlayerPoC::printCardSummary(Stream &out) const
{
  if (!cardMounted) {
    out.println("MEDIA SD: no card mounted");
    return;
  }

  const char *type = "UNKNOWN";
  if (mountedCardType == MEDIA_CARD_SDV1) type = "SDSC v1";
  else if (mountedCardType == MEDIA_CARD_SDV2) type = "SDSC v2";
  else if (mountedCardType == MEDIA_CARD_SDHC) type = "SDHC";
  else if (mountedCardType == MEDIA_CARD_SDXC) type = "SDXC";

  if (mediaFs.accessMode() == MediaFsAccessMode::TransferReadWrite) {
    out.printf("MEDIA SD: mounted type=%s filesystem=%s backend=SdFat-%s "
               "size=%llu MiB clock=%lu Hz access=transfer-rw\n",
               type, mediaFs.fileSystemName(), SD_FAT_VERSION_STR,
               (unsigned long long)(
                   mountedCardSizeBytes / (1024ULL * 1024ULL)),
               (unsigned long)mountedFrequencyHz);
  } else {
    // Preserve the established normal-mode line for monitor compatibility.
    out.printf("MEDIA SD: mounted type=%s filesystem=%s backend=SdFat-%s "
               "size=%llu MiB clock=%lu Hz read-policy=read-only\n",
               type, mediaFs.fileSystemName(), SD_FAT_VERSION_STR,
               (unsigned long long)(
                   mountedCardSizeBytes / (1024ULL * 1024ULL)),
               (unsigned long)mountedFrequencyHz);
  }
}

bool MediaPlayerPoC::isPlayablePath(const char *path)
{
  return endsWithIgnoreCase(path, ".wav") ||
         endsWithIgnoreCase(path, ".flac") ||
         endsWithIgnoreCase(path, ".mp3");
}

const char *MediaPlayerPoC::formatName(MediaFileFormat format)
{
  switch (format) {
    case MediaFileFormat::Wav: return "WAV";
    case MediaFileFormat::Flac: return "FLAC";
    case MediaFileFormat::Mp3: return "MP3";
    default: return "UNKNOWN";
  }
}

const char *MediaPlayerPoC::stateName(MediaPlaybackState state)
{
  switch (state) {
    case MediaPlaybackState::Starting: return "STARTING";
    case MediaPlaybackState::Playing: return "PLAYING";
    case MediaPlaybackState::Paused: return "PAUSED";
    case MediaPlaybackState::Seeking: return "SEEKING";
    case MediaPlaybackState::Draining: return "DRAINING";
    case MediaPlaybackState::Finished: return "FINISHED";
    case MediaPlaybackState::Error: return "ERROR";
    default: return "STOPPED";
  }
}

void MediaPlayerPoC::printDirectory(Stream &out, const char *path, size_t maxEntries)
{
  if (!cardMounted) {
    out.println("MEDIA LIST: card is not mounted");
    return;
  }

  MediaFsFile directory;
  {
    SharedSpiGuard guard;
    directory = mediaFs.open(path);
  }
  if (!directory || !directory.isDirectory()) {
    out.printf("MEDIA LIST: cannot open directory %s\n", path ? path : "(null)");
    return;
  }

  out.printf("MEDIA LIST: %s (maximum %u entries; no recursive scan)\n",
             path, (unsigned)maxEntries);

  size_t shown = 0;
  size_t playable = 0;
  bool truncated = false;
  while (shown < maxEntries) {
    char entryPath[MEDIA_FS_PATH_CAPACITY] = {0};
    bool directoryEntry = false;
    bool haveEntry = false;
    {
      SharedSpiGuard guard;
      MediaFsFile entry = directory.openNextFile();
      if (entry) {
        strlcpy(entryPath, entry.path(), sizeof(entryPath));
        directoryEntry = entry.isDirectory();
        entry.close();
        haveEntry = true;
      }
    }
    if (!haveEntry) break;

    if (directoryEntry) {
      out.printf("  DIR   %s\n", entryPath);
    } else if (isPlayablePath(entryPath)) {
      MediaFileInfo info;
      bool probed = probeFile(entryPath, info);
      playable++;
      if (probed) {
        out.printf("  %-4s  %6lu Hz  %2u-bit  %uch  %-11s  %s\n",
                   formatName(info.format),
                   (unsigned long)info.sampleRate,
                   info.bitsPerSample,
                   info.channels,
                   info.nativeRateSupported ? "NATIVE_OK" : "RATE_REJECT",
                   entryPath);
      } else {
        out.printf("  BAD   header probe failed                     %s\n", entryPath);
      }
    } else {
      out.printf("  FILE  %s\n", entryPath);
    }
    shown++;
  }

  if (shown == maxEntries) {
    SharedSpiGuard guard;
    MediaFsFile extra = directory.openNextFile();
    truncated = (bool)extra;
    if (extra) extra.close();
  }
  {
    SharedSpiGuard guard;
    directory.close();
  }
  out.printf("MEDIA LIST: shown=%u playable=%u%s\n",
             (unsigned)shown, (unsigned)playable,
             truncated ? " truncated=yes" : "");
}

size_t MediaPlayerPoC::listDirectoryPage(
    const char *path, MediaBrowserEntry *entries, size_t capacity,
    MediaDirectoryPageMode mode, const MediaBrowserEntry *anchor,
    MediaDirectoryPageInfo &pageInfo)
{
  pageInfo = MediaDirectoryPageInfo{};
  if (!entries || capacity == 0) return 0;
  for (size_t i = 0; i < capacity; i++) clearBrowserEntry(entries[i]);
  if (!cardMounted || !path || !path[0]) return 0;

  if (mode != MediaDirectoryPageMode::First && !anchor) {
    mode = MediaDirectoryPageMode::First;
  }

  MediaFsFile &directory = browserDirectoryScratch;
  MediaFsFile &entry = browserEntryScratch;
  MediaBrowserEntry &candidate = browserCandidateScratch;
  entry.close();
  directory.close();
  clearBrowserEntry(candidate);
  {
    SharedSpiGuard guard;
    directory = mediaFs.open(path);
    if (!directory || !directory.isDirectory()) {
      if (directory) directory.close();
      return 0;
    }
    if (!directory.rewindDirectory()) {
      Serial.printf("MEDIA FS: directory rewind failed path=%s\n", path);
      directory.close();
      return 0;
    }
  }

  const bool keepLargest =
      mode == MediaDirectoryPageMode::Before ||
      mode == MediaDirectoryPageMode::AtOrBefore;
  size_t count = 0;
  uint32_t entriesBeforeAnchor = 0;
  uint32_t entriesAfterAnchor = 0;
  uint32_t entriesEqualAnchor = 0;
  uint8_t emptyDirectoryReopenCount = 0;

  while (true) {
    entry.close();
    clearBrowserEntry(candidate);
    bool accepted = false;

    {
      SharedSpiGuard guard;
      uint32_t skippedEntries = 0;
      bool haveEntry = directory.openNextFile(entry, &skippedEntries);
      if (skippedEntries) {
        const uint32_t rawRoom = UINT32_MAX - pageInfo.rawEntriesScanned;
        pageInfo.rawEntriesScanned += std::min(rawRoom, skippedEntries);
        const uint32_t skipRoom = UINT32_MAX - pageInfo.skippedLongPaths;
        pageInfo.skippedLongPaths += std::min(skipRoom, skippedEntries);
      }
      if (!haveEntry) {
        bool reopened = false;
        if (pageInfo.rawEntriesScanned == 0U &&
            emptyDirectoryReopenCount == 0U) {
          entry.close();
          directory.close();
          directory = mediaFs.open(path);
          reopened = directory && directory.isDirectory() &&
                     directory.rewindDirectory();
          if (reopened) {
            emptyDirectoryReopenCount++;
            Serial.printf(
                "MEDIA FS: empty directory reopened once path=%s\n", path);
          } else if (directory) {
            directory.close();
          }
        }
        if (reopened) continue;
        break;
      }

