CrawlingKingSn8ke/DSPi-ESP32-Front-Panel-Media-Player-SPDIF/firmware/DSPi_ESP32_Front_Panel_v1_1_2/MediaPlayerPoC.cpp
      if (pageInfo.rawEntriesScanned != UINT32_MAX) {
        pageInfo.rawEntriesScanned++;
      }

      const char *entryPath = entry.path();
      const char *entryName = entry.name();
      candidate.directory = entry.isDirectory();
      candidate.format = MediaFileFormat::Unknown;
      if (!candidate.directory) {
        candidate.format = formatFromPath(entryPath);
      }
      // SdFat supplies both a full reconstructed path and the leaf name. The
      // path should normally be authoritative, but accepting a valid leaf
      // extension as a fallback prevents a harmless path-reconstruction edge
      // case from making an otherwise ordinary FLAC/WAV/MP3 folder look empty.
      if (!candidate.directory &&
          candidate.format == MediaFileFormat::Unknown) {
        candidate.format = formatFromPath(entryName);
      }

      const bool named = entryPath && entryPath[0] &&
                         entryName && entryName[0];
      const bool hidden = named && hiddenBrowserName(entryName);
      const bool supported = candidate.directory ||
                             candidate.format != MediaFileFormat::Unknown;
      if (!supported && !candidate.directory &&
          pageInfo.skippedUnsupportedFiles != UINT32_MAX) {
        pageInfo.skippedUnsupportedFiles++;
      }
      if (hidden && pageInfo.skippedHiddenEntries != UINT32_MAX) {
        pageInfo.skippedHiddenEntries++;
      }
      if (supported && named && !hidden) {
        if (std::strlen(entryPath) >= sizeof(candidate.path) ||
            std::strlen(entryName) >= sizeof(candidate.name)) {
          if (pageInfo.skippedLongPaths != UINT32_MAX) {
            pageInfo.skippedLongPaths++;
          }
        } else {
          strlcpy(candidate.path, entryPath, sizeof(candidate.path));
          strlcpy(candidate.name, entryName, sizeof(candidate.name));
          accepted = true;
        }
      }
      entry.close();
    }

    if ((pageInfo.rawEntriesScanned & 0x1FU) == 0) delay(0);
    if (!accepted) continue;

    if (pageInfo.totalEntries != UINT32_MAX) pageInfo.totalEntries++;

    int relation = anchor ? compareBrowserEntries(candidate, *anchor) : 1;
    if (anchor) {
      if (relation < 0 && entriesBeforeAnchor != UINT32_MAX) {
        entriesBeforeAnchor++;
      } else if (relation > 0 && entriesAfterAnchor != UINT32_MAX) {
        entriesAfterAnchor++;
      } else if (relation == 0 && entriesEqualAnchor != UINT32_MAX) {
        entriesEqualAnchor++;
      }
    }

    bool eligible = false;
    switch (mode) {
      case MediaDirectoryPageMode::First:
        eligible = true;
        break;
      case MediaDirectoryPageMode::After:
        eligible = relation > 0;
        break;
      case MediaDirectoryPageMode::Before:
        eligible = relation < 0;
        break;
      case MediaDirectoryPageMode::AtOrAfter:
        eligible = relation >= 0;
        break;
      case MediaDirectoryPageMode::AtOrBefore:
        eligible = relation <= 0;
        break;
    }
    if (!eligible) continue;

    if (pageInfo.eligibleEntries != UINT32_MAX) pageInfo.eligibleEntries++;
    insertBrowserPageCandidate(entries, count, capacity, candidate, keepLargest);
  }

  {
    SharedSpiGuard guard;
    entry.close();
    directory.close();
  }

  switch (mode) {
    case MediaDirectoryPageMode::First:
      pageInfo.firstEntryIndex = 0;
      pageInfo.hasPrevious = false;
      pageInfo.hasNext = pageInfo.eligibleEntries > count;
      break;
    case MediaDirectoryPageMode::After:
      pageInfo.firstEntryIndex =
          pageInfo.totalEntries - pageInfo.eligibleEntries;
      pageInfo.hasPrevious = entriesBeforeAnchor > 0 || entriesEqualAnchor > 0;
      pageInfo.hasNext = pageInfo.eligibleEntries > count;
      break;
    case MediaDirectoryPageMode::Before:
      pageInfo.firstEntryIndex = pageInfo.eligibleEntries > count
          ? pageInfo.eligibleEntries - count : 0;
      pageInfo.hasPrevious = pageInfo.eligibleEntries > count;
      pageInfo.hasNext = entriesAfterAnchor > 0 || entriesEqualAnchor > 0;
      break;
    case MediaDirectoryPageMode::AtOrAfter:
      pageInfo.firstEntryIndex = entriesBeforeAnchor;
      pageInfo.hasPrevious = entriesBeforeAnchor > 0;
      pageInfo.hasNext = pageInfo.eligibleEntries > count;
      break;
    case MediaDirectoryPageMode::AtOrBefore:
      pageInfo.firstEntryIndex = pageInfo.eligibleEntries > count
          ? pageInfo.eligibleEntries - count : 0;
      pageInfo.hasPrevious = pageInfo.eligibleEntries > count;
      pageInfo.hasNext = entriesAfterAnchor > 0;
      break;
  }
  return count;
}

size_t MediaPlayerPoC::listRootPlayable(MediaPlayableEntry *entries,
                                        size_t capacity, size_t maxEntries)
{
  if (!entries || capacity == 0) return 0;
  for (size_t i = 0; i < capacity; i++) entries[i] = MediaPlayableEntry{};
  if (!cardMounted) return 0;

  SharedSpiGuard guard;
  MediaFsFile directory = mediaFs.open("/");
  if (!directory || !directory.isDirectory()) return 0;

  size_t count = 0;
  size_t shown = 0;
  MediaFsFile entry = directory.openNextFile();
  while (entry && shown < maxEntries) {
    const char *entryPath = entry.path();
    if (!entry.isDirectory() && isPlayablePath(entryPath)) {
      MediaFileInfo info;
      bool ok = probeFile(entryPath, info) &&
                info.nativeRateSupported &&
                (info.channels == 1 || info.channels == 2) &&
                sourceDepthSupported(info.format, info.bitsPerSample);
      if (ok && count < capacity) {
        strlcpy(entries[count].path, entryPath, sizeof(entries[count].path));
        entries[count].info = info;
        count++;
      }
    }

    entry.close();
    shown++;
    entry = directory.openNextFile();
  }

  if (entry) entry.close();
  directory.close();
  return count;
}

bool MediaPlayerPoC::loadArtworkJpeg(
    const char *audioPath, uint8_t **data, size_t *length,
    const MediaArtworkControl *control, MediaArtworkSource *source)
{
  if (data) *data = nullptr;
  if (length) *length = 0;
  if (source) *source = MediaArtworkSource::None;
  ArtworkLocation location;
  if (!data || !length || !cardMounted || !audioPath || !audioPath[0] ||
      std::strlen(audioPath) >= sizeof(location.path)) {
    return false;
  }

  MediaArtworkSource selectedSource = MediaArtworkSource::None;
  MediaFsFile audioFile;
  bool audioOpen = false;
  {
    if (!waitForArtworkPermit(control)) return false;
    SharedSpiGuard guard;
    audioFile = mediaFs.open(audioPath);
    audioOpen = audioFile && !audioFile.isDirectory();
  }

