CrawlingKingSn8ke/DSPi-ESP32-Front-Panel-Media-Player-SPDIF/firmware/DSPi_ESP32_Front_Panel_v1_1_2/MediaPlayerPoC.cpp
  if (audioOpen) {
    if (endsWithIgnoreCase(audioPath, ".mp3") &&
        locateMp3Artwork(audioFile, audioPath, location, control)) {
      selectedSource = MediaArtworkSource::Mp3Apic;
    } else if (endsWithIgnoreCase(audioPath, ".flac") &&
               locateFlacArtwork(audioFile, audioPath, location, control)) {
      selectedSource = MediaArtworkSource::FlacPicture;
    }
  }
  if (audioFile) {
    SharedSpiGuard guard;
    audioFile.close();
  }

  if (!location.length) {
    if (!locateFolderArtwork(audioPath, location, control)) return false;
    selectedSource = MediaArtworkSource::FolderJpeg;
  }

  if (!readArtworkLocation(location, data, length, control)) return false;
  if (source) *source = selectedSource;
  return true;
}

bool MediaPlayerPoC::loadFolderArtworkJpeg(
    const char *audioPath, uint8_t **data, size_t *length,
    const MediaArtworkControl *control)
{
  if (data) *data = nullptr;
  if (length) *length = 0;
  if (!data || !length || !cardMounted || !audioPath || !audioPath[0]) {
    return false;
  }
  ArtworkLocation location;
  return locateFolderArtwork(audioPath, location, control) &&
         readArtworkLocation(location, data, length, control);
}

const char *MediaPlayerPoC::artworkSourceName(MediaArtworkSource source)
{
  switch (source) {
    case MediaArtworkSource::Mp3Apic: return "mp3-apic";
    case MediaArtworkSource::FlacPicture: return "flac-picture";
    case MediaArtworkSource::FolderJpeg: return "folder-jpeg";
    case MediaArtworkSource::None: return "none";
  }
  return "unknown";
}

void MediaPlayerPoC::freeArtworkJpeg(uint8_t *data)
{
  if (data) heap_caps_free(data);
}

bool MediaPlayerPoC::probeFile(const char *path, MediaFileInfo &info)
{
  info = MediaFileInfo{};
  if (!cardMounted || !path) return false;

  SharedSpiGuard guard;
  MediaFsFile file = mediaFs.open(path);
  if (!file || file.isDirectory()) return false;

  bool ok = false;
  if (endsWithIgnoreCase(path, ".wav")) ok = probeWav(file, info);
  else if (endsWithIgnoreCase(path, ".flac")) ok = probeFlac(file, info);
  else if (endsWithIgnoreCase(path, ".mp3")) ok = probeMp3(file, info);

  file.close();
  if (ok) {
    info.valid = true;
    info.nativeRateSupported = nativeRateSupported(info.sampleRate);
  }
  return ok;
}

bool MediaPlayerPoC::probeWav(MediaFsFile &file, MediaFileInfo &info)
{
  uint8_t header[12];
  file.seek(0);
  if (!readExact(file, header, sizeof(header))) return false;
  if (std::memcmp(header, "RIFF", 4) != 0 ||
      std::memcmp(header + 8, "WAVE", 4) != 0) return false;

  bool foundFormat = false;
  for (uint8_t chunkIndex = 0; chunkIndex < 32 && file.available(); chunkIndex++) {
    uint8_t chunkHeader[8];
    if (!readExact(file, chunkHeader, sizeof(chunkHeader))) break;
    uint32_t chunkSize = readLe32(chunkHeader + 4);
    uint64_t chunkDataPosition = file.position();

    if (std::memcmp(chunkHeader, "fmt ", 4) == 0 && chunkSize >= 16) {
      uint8_t format[16];
      if (!readExact(file, format, sizeof(format))) return false;
      uint16_t encoding = readLe16(format);
      if (encoding != 1 && encoding != 3 && encoding != 0xFFFE) return false;
      info.format = MediaFileFormat::Wav;
      info.channels = (uint8_t)readLe16(format + 2);
      info.sampleRate = readLe32(format + 4);
      info.bitsPerSample = (uint8_t)readLe16(format + 14);
      if (encoding == 0xFFFE) {
        if (chunkSize < 40) return false;
        uint8_t extensible[24];
        if (!readExact(file, extensible, sizeof(extensible))) return false;
        uint16_t validBits = readLe16(extensible + 2);
        if (validBits) info.bitsPerSample = (uint8_t)validBits;
      }
      foundFormat = info.channels > 0 && info.sampleRate > 0 &&
                    info.bitsPerSample > 0;
    }

    uint64_t next = (uint64_t)chunkDataPosition + chunkSize + (chunkSize & 1U);
    if (next > file.size()) break;
    if (!file.seek(next)) break;
    if (foundFormat) return true;
  }
  return false;
}

bool MediaPlayerPoC::probeFlac(MediaFsFile &file, MediaFileInfo &info)
{
  uint64_t streamOffset = 0;
  MediaFileInfo streamInfo;
  bool haveNativeStreamInfo =
      findFlacStreamOffset(file, streamOffset) &&
      readNativeFlacStreamInfo(file, streamOffset, streamInfo);

  FlacStreamContext stream;
  drflac *flac = openFlacStream(file, stream);
  if (!flac) {
    Serial.printf("MEDIA FLAC: decoder probe failed path=%s size=%llu\n",
                  file.path(), (unsigned long long)file.size());
    return false;
  }
  if (stream.baseOffset > 0) {
    Serial.printf("MEDIA FLAC: skipped %llu leading metadata bytes path=%s\n",
                  (unsigned long long)stream.baseOffset, file.path());
  }

  MediaFileInfo decoderInfo;
  decoderInfo.format = MediaFileFormat::Flac;
  decoderInfo.sampleRate = flac->sampleRate;
  decoderInfo.channels = flac->channels;
  decoderInfo.bitsPerSample = flac->bitsPerSample;
  decoderInfo.totalFrames = flac->totalPCMFrameCount;
  decoderInfo.valid = decoderInfo.sampleRate > 0 &&
                      decoderInfo.channels > 0 &&
                      decoderInfo.bitsPerSample > 0;
  decoderInfo.nativeRateSupported =
      nativeRateSupported(decoderInfo.sampleRate);

  if (haveNativeStreamInfo) {
    info = streamInfo;
    if (decoderInfo.sampleRate != streamInfo.sampleRate ||
        decoderInfo.channels != streamInfo.channels ||
        decoderInfo.bitsPerSample != streamInfo.bitsPerSample) {
      Serial.printf(
          "MEDIA FLAC: STREAMINFO/decoder mismatch path=%s "
          "stream=%luHz/%ubit/%uch decoder=%luHz/%ubit/%uch; "
          "using STREAMINFO\n",
          file.path(), (unsigned long)streamInfo.sampleRate,
          streamInfo.bitsPerSample, streamInfo.channels,
          (unsigned long)decoderInfo.sampleRate,
          decoderInfo.bitsPerSample, decoderInfo.channels);
    }
  } else {
    info = decoderInfo;
  }
  drflac_close(flac);

  return info.sampleRate > 0 && info.channels > 0 &&
         info.bitsPerSample > 0;
}

