CrawlingKingSn8ke/DSPi-ESP32-Front-Panel-Media-Player-SPDIF/firmware/DSPi_ESP32_Front_Panel_v1_1_2/MediaPlayerPoC.cpp
bool MediaPlayerPoC::probeMp3(MediaFsFile &file, MediaFileInfo &info)
{
  file.seek(0);
  uint8_t firstTen[10];
  uint32_t scanStart = 0;
  if (readExact(file, firstTen, sizeof(firstTen)) &&
      std::memcmp(firstTen, "ID3", 3) == 0) {
    for (uint8_t i = 6; i < 10; i++) {
      if (firstTen[i] & 0x80) return false;
    }
    uint32_t tagSize = ((uint32_t)firstTen[6] << 21) |
                       ((uint32_t)firstTen[7] << 14) |
                       ((uint32_t)firstTen[8] << 7) |
                       firstTen[9];
    scanStart = 10 + tagSize + ((firstTen[5] & 0x10) ? 10 : 0);
  }

  if (scanStart >= file.size() || !file.seek(scanStart)) return false;
  size_t remaining = (size_t)std::min<uint64_t>(kMp3ScanLimit,
                                                file.size() - scanStart);
  if (remaining < 4) return false;

  uint8_t window[4];
  if (!readExact(file, window, sizeof(window))) return false;
  remaining -= sizeof(window);

  while (true) {
    uint32_t header = ((uint32_t)window[0] << 24) |
                      ((uint32_t)window[1] << 16) |
                      ((uint32_t)window[2] << 8) |
                      window[3];
    bool sync = (header & 0xFFE00000U) == 0xFFE00000U;
    uint8_t version = (header >> 19) & 0x03;
    uint8_t layer = (header >> 17) & 0x03;
    uint8_t bitrateIndex = (header >> 12) & 0x0F;
    uint8_t rateIndex = (header >> 10) & 0x03;

    if (sync && version != 1 && layer == 1 &&
        bitrateIndex != 0 && bitrateIndex != 15 && rateIndex != 3) {
      static const uint32_t mpeg1Rates[3] = {44100, 48000, 32000};
      uint32_t rate = mpeg1Rates[rateIndex];
      if (version == 2) rate /= 2;
      else if (version == 0) rate /= 4;

      info.format = MediaFileFormat::Mp3;
      info.sampleRate = rate;
      info.channels = ((header >> 6) & 0x03) == 3 ? 1 : 2;
      info.bitsPerSample = 16;
      return true;
    }

    if (remaining == 0) break;
    int next = file.read();
    if (next < 0) break;
    window[0] = window[1];
    window[1] = window[2];
    window[2] = window[3];
    window[3] = (uint8_t)next;
    remaining--;
  }
  return false;
}

bool MediaPlayerPoC::openDecoder(const char *path, MediaFileInfo &info)
{
  closeDecoder();
  return openDecoderState(path, decoder, info);
}

bool MediaPlayerPoC::openDecoderState(const char *path, DecoderState *&target,
                                      MediaFileInfo &info)
{
  closeDecoderState(target);
  target = new (std::nothrow) DecoderState();
  if (!target) return false;

  {
    SharedSpiGuard guard;
    target->file = mediaFs.open(path);
    if (!target->file || target->file.isDirectory()) {
      closeDecoderState(target);
      return false;
    }
  }

  target->io.file = &target->file;
  target->io.cancelRequested = &stopRequested;
  target->io.readTelemetry.stats = &stats;
  target->flacStream.cancelRequested = &stopRequested;
  target->flacStream.readTelemetry.stats = &stats;

  info = MediaFileInfo{};
  if (endsWithIgnoreCase(path, ".wav")) {
    target->wavOpen = drwav_init(&target->wav, decoderRead, wavSeek, wavTell,
                                 &target->io, nullptr) == DRWAV_TRUE;
    if (target->wavOpen) {
      info.format = MediaFileFormat::Wav;
      info.sampleRate = target->wav.sampleRate;
      info.channels = (uint8_t)target->wav.channels;
      info.bitsPerSample = target->wav.fmt.validBitsPerSample
                               ? (uint8_t)target->wav.fmt.validBitsPerSample
                               : (uint8_t)target->wav.bitsPerSample;
      info.totalFrames = target->wav.totalPCMFrameCount;
    }
  } else if (endsWithIgnoreCase(path, ".flac")) {
    uint64_t streamOffset = 0;
    MediaFileInfo streamInfo;
    bool haveNativeStreamInfo =
        findFlacStreamOffset(target->file, streamOffset) &&
        readNativeFlacStreamInfo(target->file, streamOffset, streamInfo);

    target->flac = openFlacStream(target->file, target->flacStream);
    if (target->flac) {
      if (haveNativeStreamInfo) {
        info = streamInfo;
        if (target->flac->sampleRate != streamInfo.sampleRate ||
            target->flac->channels != streamInfo.channels ||
            target->flac->bitsPerSample != streamInfo.bitsPerSample) {
          Serial.printf(
              "MEDIA FLAC: playback metadata corrected path=%s "
              "stream=%luHz/%ubit/%uch decoder=%luHz/%ubit/%uch\n",
              path, (unsigned long)streamInfo.sampleRate,
              streamInfo.bitsPerSample, streamInfo.channels,
              (unsigned long)target->flac->sampleRate,
              target->flac->bitsPerSample, target->flac->channels);
        }
      } else {
        info.format = MediaFileFormat::Flac;
        info.sampleRate = target->flac->sampleRate;
        info.channels = target->flac->channels;
        info.bitsPerSample = target->flac->bitsPerSample;
        info.totalFrames = target->flac->totalPCMFrameCount;
      }
    }
  } else if (endsWithIgnoreCase(path, ".mp3")) {
    target->mp3Open =
        drmp3_init(&target->mp3, decoderRead, mp3Seek, mp3Tell, nullptr,
                   &target->io, nullptr) == DRMP3_TRUE;
    if (target->mp3Open) {
      info.format = MediaFileFormat::Mp3;
      info.sampleRate = target->mp3.sampleRate;
      info.channels = (uint8_t)target->mp3.channels;
      info.bitsPerSample = 16;
      // Xing/Info headers provide this immediately. Do not force a full-file
      // scan when the stream has no native frame count; zero continues to mean
      // "duration unknown" for long files without an index.
      info.totalFrames =
          target->mp3.totalPCMFrameCount != DRMP3_UINT64_MAX
              ? drmp3_get_pcm_frame_count(&target->mp3)
              : 0;
    }
  }

  info.valid = info.format != MediaFileFormat::Unknown &&
               info.sampleRate > 0 && info.channels > 0;
  info.nativeRateSupported = nativeRateSupported(info.sampleRate);
  if (!info.valid || !info.nativeRateSupported ||
      (info.channels != 1 && info.channels != 2) ||
      !sourceDepthSupported(info.format, info.bitsPerSample)) {
    closeDecoderState(target);
    return false;
  }
  return true;
}

bool MediaPlayerPoC::seekDecoderToFrame(uint64_t frame, uint32_t generation)
{
  if (!decoder) return false;
  if (decoder->wavOpen) {
    return drwav_seek_to_pcm_frame(&decoder->wav, frame) == DRWAV_TRUE;
  }
  if (decoder->flac) {
    return drflac_seek_to_pcm_frame(decoder->flac, frame) == DRFLAC_TRUE;
  }
  // MP3 is intentionally excluded. performSeek() uses an isolated candidate
  // decoder so a failed unindexed scan can never move the live decoder.
  return false;
}

MediaPlayerPoC::Mp3SeekAttempt MediaPlayerPoC::seekMp3CandidateToFrame(
    DecoderState &candidate, uint64_t frame, uint32_t generation,
    uint32_t budgetMs)
{
  Mp3SeekAttempt attempt;
  const uint32_t startedAt = millis();
  if (!candidate.mp3Open) {
    attempt.result = Mp3SeekAttemptResult::OpenFailure;
    return attempt;
  }

  drmp3 &mp3 = candidate.mp3;
  if (mp3.currentPCMFrame != 0 &&
      drmp3_seek_to_pcm_frame(&mp3, 0) != DRMP3_TRUE) {
    attempt.result = Mp3SeekAttemptResult::DecodeFailure;
    attempt.elapsedMs = millis() - startedAt;
    return attempt;
  }

  uint64_t remaining = frame;
  while (remaining > 0) {
    if (stopRequested) {
      attempt.result = Mp3SeekAttemptResult::Stopped;
      break;
    }
    if (generation &&
        __atomic_load_n(&seekGeneration, __ATOMIC_ACQUIRE) != generation) {
      attempt.result = Mp3SeekAttemptResult::Superseded;
      break;
    }
    if ((uint32_t)(millis() - startedAt) >= budgetMs) {
      attempt.result = Mp3SeekAttemptResult::Timeout;
      break;
    }

