CrawlingKingSn8ke/DSPi-ESP32-Front-Panel-Media-Player-SPDIF/firmware/DSPi_ESP32_Front_Panel_v1_1_2/MediaPlayerPoC.cpp
    const uint64_t chunk =
        std::min<uint64_t>(remaining, kMp3SeekYieldFrames);
    const uint64_t read =
        drmp3_read_pcm_frames_s16(&mp3, chunk, nullptr);
    attempt.framesScanned += read;
    if (read != chunk) {
      attempt.result = Mp3SeekAttemptResult::DecodeFailure;
      break;
    }
    remaining -= read;

    // A yield alone can immediately reschedule this priority-3 task. Block for
    // one RTOS tick so CPU0's idle task and control work remain responsive.
    vTaskDelay(1);
  }

  if (remaining == 0) {
    attempt.result = Mp3SeekAttemptResult::Completed;
  }
  attempt.elapsedMs = millis() - startedAt;
  return attempt;
}

bool MediaPlayerPoC::prefillMp3Candidate(
    DecoderState &candidate, int32_t *prefill, size_t capacityFrames,
    size_t &framesWritten, bool &reachedEnd, uint32_t generation,
    Mp3SeekAttemptResult &failure)
{
  framesWritten = 0;
  reachedEnd = false;
  failure = Mp3SeekAttemptResult::PrefillFailure;
  if (!prefill || capacityFrames == 0) return false;

  const uint32_t startedAt = millis();
  while (framesWritten < capacityFrames) {
    if (stopRequested) {
      failure = Mp3SeekAttemptResult::Stopped;
      return false;
    }
    if (generation &&
        __atomic_load_n(&seekGeneration, __ATOMIC_ACQUIRE) != generation) {
      failure = Mp3SeekAttemptResult::Superseded;
      return false;
    }
    if ((uint32_t)(millis() - startedAt) >= kSeekPrefillTimeoutMs) {
      failure = Mp3SeekAttemptResult::PrefillFailure;
      return false;
    }

    const size_t request =
        std::min(kDecodeChunkFrames, capacityFrames - framesWritten);
    bool ioFault = false;
    const size_t frames =
        decodeFramesFrom(candidate, currentFile, candidate.stereo, request,
                         ioFault);
    if (frames == 0) {
      if (ioFault) {
        failure = Mp3SeekAttemptResult::DecodeFailure;
        return false;
      }
      reachedEnd = true;
      break;
    }
    memcpy(prefill + framesWritten * 2, candidate.stereo,
           frames * 2 * sizeof(prefill[0]));
    framesWritten += frames;
    updateTaskStackWatermark(true);
    vTaskDelay(1);
  }

  if (framesWritten == 0) return false;
  failure = Mp3SeekAttemptResult::Completed;
  return true;
}

const char *MediaPlayerPoC::mp3SeekAttemptName(Mp3SeekAttemptResult result)
{
  switch (result) {
    case Mp3SeekAttemptResult::Completed: return "completed";
    case Mp3SeekAttemptResult::Timeout: return "timeout";
    case Mp3SeekAttemptResult::Stopped: return "stop";
    case Mp3SeekAttemptResult::Superseded: return "superseded";
    case Mp3SeekAttemptResult::DecodeFailure: return "decode-failure";
    case Mp3SeekAttemptResult::HeapIntegrityFailure:
      return "heap-integrity-failure";
    case Mp3SeekAttemptResult::OpenFailure: return "open-failure";
    case Mp3SeekAttemptResult::AllocationFailure: return "allocation-failure";
    case Mp3SeekAttemptResult::PrefillFailure: return "prefill-failure";
    default: return "unknown";
  }
}

void MediaPlayerPoC::resetRing()
{
  __atomic_store_n(&ringReadCount, 0, __ATOMIC_RELEASE);
  __atomic_store_n(&ringWriteCount, 0, __ATOMIC_RELEASE);
}

void MediaPlayerPoC::updateTaskStackWatermark(bool decoderTaskContext)
{
  uint32_t freeStack = (uint32_t)uxTaskGetStackHighWaterMark(nullptr);
  volatile uint32_t *destination = decoderTaskContext
      ? &stats.decoderStackMinFree : &stats.outputStackMinFree;
  uint32_t previous = __atomic_load_n(destination, __ATOMIC_RELAXED);
  if (previous == 0 || freeStack < previous) {
    __atomic_store_n(destination, freeStack, __ATOMIC_RELAXED);
  }
}

void MediaPlayerPoC::publishSeekEvent(MediaSeekResult result,
                                      uint64_t requestedFrame,
                                      uint64_t actualFrame,
                                      uint32_t generation,
                                      uint32_t elapsedMs)
{
  if (!seekEventQueue) return;
  MediaSeekEvent event;
  event.result = result;
  event.requestedFrame = requestedFrame;
  event.actualFrame = actualFrame;
  event.generation = generation;
  event.elapsedMs = elapsedMs;
  xQueueOverwrite(seekEventQueue, &event);
}

void MediaPlayerPoC::reportStorageReadFault(const char *stage)
{
  // Use cached metadata so fault reporting does not wait on the shared bus.
  uint64_t position = 0;
  uint64_t size = 0;
  if (decoder && decoder->file) {
    position = decoder->file.position();
    size = decoder->file.size();
  }
  const uint8_t errorCode = mediaFs.errorCode();
  const uint32_t errorData = mediaFs.errorData();
  Serial.printf(
      "MEDIA SD FAULT: stage=%s path=%s position=%llu size=%llu "
      "clock=%lu Hz code=0x%02X data=0x%08lX\n",
      stage ? stage : "unknown",
      currentPath[0] ? currentPath : "(none)",
      static_cast<unsigned long long>(position),
      static_cast<unsigned long long>(size),
      static_cast<unsigned long>(mountedFrequencyHz),
      static_cast<unsigned>(errorCode),
      static_cast<unsigned long>(errorData));
}

bool MediaPlayerPoC::prefillAfterSeek()
{
  if (!decoder) return false;
  unsigned long deadline = millis() + kSeekPrefillTimeoutMs;
  const size_t target = std::min(kSeekPrefillFrames,
                                 ringFrameCapacity / 4);
  while (!stopRequested && ringAvailable() < target &&
         ringWritable() > 0 && (long)(millis() - deadline) < 0) {
    size_t request = std::min(kDecodeChunkFrames, ringWritable());
    size_t frames = decodeFrames(decoder->stereo, request);
    updateTaskStackWatermark(true);
    if (frames == 0) {
      if (storageIoFault) {
        reportStorageReadFault("seek-prefill");
        cardMounted = false;
        setError("SD read failed or card removed");
        stopRequested = true;
        return false;
      }
      decoderComplete = true;
      break;
    }
    __atomic_add_fetch(&stats.decodedFrames, frames, __ATOMIC_RELAXED);
    if (writeRing(decoder->stereo, frames) != frames) return false;
  }
  return ringAvailable() > 0;
}

bool MediaPlayerPoC::performSeek(SeekCommand command)
{
  if (!decoder || !seekCommandQueue || !mediaControlEvents) {
    publishSeekEvent(MediaSeekResult::Failed, command.targetFrame,
                     __atomic_load_n(&stats.outputFrames, __ATOMIC_ACQUIRE),
                     command.generation, 0);
    return false;
  }

