CrawlingKingSn8ke/DSPi-ESP32-Front-Panel-Media-Player-SPDIF/firmware/DSPi_ESP32_Front_Panel_v1_1_2/MediaPlayerPoC.cpp
  const uint32_t startedAt = millis();
  const uint64_t originalFrame =
      __atomic_load_n(&stats.outputFrames, __ATOMIC_ACQUIRE);
  SeekCommand latest = command;
  const uint32_t stackBefore =
      (uint32_t)uxTaskGetStackHighWaterMark(nullptr);
  updateTaskStackWatermark(true);
  if (stackBefore < kSeekMinimumFreeStackBytes) {
    if (!stopRequested) {
      state = seekResumePaused ? MediaPlaybackState::Paused
                               : MediaPlaybackState::Playing;
    }
    __atomic_add_fetch(&stats.seekFailed, 1U, __ATOMIC_RELAXED);
    Serial.printf(
        "MEDIA SEEK: refused low decoder stack free=%lu minimum=%lu\n",
        (unsigned long)stackBefore,
        (unsigned long)kSeekMinimumFreeStackBytes);
    publishSeekEvent(MediaSeekResult::Failed, latest.targetFrame,
                     originalFrame, latest.generation, 0);
    return false;
  }

  xEventGroupClearBits(mediaControlEvents, kOutputQuiescentBit);
  xEventGroupSetBits(mediaControlEvents, kSeekActiveBit);
  EventBits_t bits = xEventGroupWaitBits(
      mediaControlEvents, kOutputQuiescentBit, pdFALSE, pdTRUE,
      pdMS_TO_TICKS(kSeekQuiesceTimeoutMs));
  if ((bits & kOutputQuiescentBit) == 0) {
    xEventGroupClearBits(mediaControlEvents,
                         kSeekActiveBit | kOutputQuiescentBit);
    if (!stopRequested) {
      state = seekResumePaused ? MediaPlaybackState::Paused
                               : MediaPlaybackState::Playing;
    }
    uint32_t elapsed = millis() - startedAt;
    __atomic_add_fetch(&stats.seekFailed, 1U, __ATOMIC_RELAXED);
    __atomic_store_n(&stats.lastSeekElapsedMs, elapsed, __ATOMIC_RELAXED);
    Serial.printf(
        "MEDIA SEEK: output quiesce timeout target=%llu elapsed=%lu ms\n",
        (unsigned long long)latest.targetFrame, (unsigned long)elapsed);
    publishSeekEvent(MediaSeekResult::Failed, latest.targetFrame,
                     originalFrame, latest.generation, elapsed);
    return false;
  }

  Serial.printf(
      "MEDIA SEEK BEGIN generation=%lu target=%llu original=%llu "
      "stack_free=%lu\n",
      (unsigned long)latest.generation,
      (unsigned long long)latest.targetFrame,
      (unsigned long long)originalFrame,
      (unsigned long)uxTaskGetStackHighWaterMark(nullptr));
  Serial.println("MEDIA SEEK: output quiescent");

  bool completed = false;
  bool restored = false;
  uint64_t actualFrame = originalFrame;

  if (decoder->mp3Open) {
    // MP3 seeks are transactional. The active decoder, buffered audio and
    // counters remain untouched until a separate decoder has reached the
    // target and produced a complete staging prefill.
    while (!stopRequested) {
      if (currentFile.totalFrames > 0) {
        latest.targetFrame = std::min<uint64_t>(
            latest.targetFrame, currentFile.totalFrames - 1);
      }

      const DspiMp3SeekPolicy::Plan plan =
          DspiMp3SeekPolicy::candidatePlan(originalFrame,
                                           latest.targetFrame);
      const uint64_t requestedDistance =
          latest.targetFrame >= originalFrame
              ? latest.targetFrame - originalFrame
              : originalFrame - latest.targetFrame;
      Serial.printf(
          "MEDIA SEEK MP3 PLAN strategy=candidate-restart generation=%lu "
          "source=%llu target=%llu distance=%llu scan=%llu budget=%lu "
          "cap=%lu original_intact=yes\n",
          (unsigned long)latest.generation,
          (unsigned long long)originalFrame,
          (unsigned long long)latest.targetFrame,
          (unsigned long long)requestedDistance,
          (unsigned long long)plan.scanFrames,
          (unsigned long)plan.budgetMs,
          (unsigned long)DspiMp3SeekPolicy::kAbsoluteBudgetMs);

      DecoderState *candidate = nullptr;
      int32_t *candidatePrefill = static_cast<int32_t *>(heap_caps_malloc(
          kSeekPrefillFrames * 2 * sizeof(int32_t),
          MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));
      Mp3SeekAttempt attempt;
      MediaFileInfo candidateInfo;
      size_t candidatePrefillFrames = 0;
      bool candidateReachedEnd = false;
      bool candidateReady = false;
      const uint32_t candidateStartedAt = millis();

      if (!candidatePrefill) {
        attempt.result = Mp3SeekAttemptResult::AllocationFailure;
      } else if (!heap_caps_check_integrity_all(true)) {
        attempt.result = Mp3SeekAttemptResult::HeapIntegrityFailure;
      } else if (!openDecoderState(currentPath, candidate, candidateInfo) ||
                 candidateInfo.format != MediaFileFormat::Mp3 ||
                 candidateInfo.sampleRate != currentFile.sampleRate ||
                 candidateInfo.channels != currentFile.channels) {
        attempt.result = Mp3SeekAttemptResult::OpenFailure;
      } else {
        attempt = seekMp3CandidateToFrame(
            *candidate, latest.targetFrame, latest.generation,
            plan.budgetMs);
        if (attempt.result == Mp3SeekAttemptResult::Completed) {
          Mp3SeekAttemptResult prefillFailure =
              Mp3SeekAttemptResult::PrefillFailure;
          candidateReady = prefillMp3Candidate(
              *candidate, candidatePrefill, kSeekPrefillFrames,
              candidatePrefillFrames, candidateReachedEnd,
              latest.generation, prefillFailure);
          if (!candidateReady) attempt.result = prefillFailure;
        }
        if (!heap_caps_check_integrity_all(true)) {
          candidateReady = false;
          attempt.result = Mp3SeekAttemptResult::HeapIntegrityFailure;
        }
      }
      attempt.elapsedMs = millis() - candidateStartedAt;

      SeekCommand replacement;
      const bool haveReplacement =
          xQueueReceive(seekCommandQueue, &replacement, 0) == pdTRUE;
      if (haveReplacement ||
          __atomic_load_n(&seekGeneration, __ATOMIC_ACQUIRE) !=
              latest.generation) {
        candidateReady = false;
        if (!stopRequested) {
          attempt.result = Mp3SeekAttemptResult::Superseded;
        }
      }

      Serial.printf(
          "MEDIA SEEK MP3 ATTEMPT generation=%lu result=%s "
          "frames_scanned=%llu prefill=%u elapsed=%lu ms "
          "original_intact=yes\n",
          (unsigned long)latest.generation,
          mp3SeekAttemptName(attempt.result),
          (unsigned long long)attempt.framesScanned,
          (unsigned)candidatePrefillFrames,
          (unsigned long)attempt.elapsedMs);

      if (candidateReady) {
        // The empty-ring write is deterministic because the staged frame count
        // is bounded by both kSeekPrefillFrames and ring capacity.
        const size_t commitFrames =
            std::min(candidatePrefillFrames, ringFrameCapacity);
        if (commitFrames > 0) {
          resetRing();
          const size_t committed =
              writeRing(candidatePrefill, commitFrames);
          DecoderState *previous = decoder;
          decoder = candidate;
          candidate = nullptr;
          decoderComplete = candidateReachedEnd;
          __atomic_store_n(&stats.outputFrames, latest.targetFrame,
                           __ATOMIC_RELEASE);
          __atomic_store_n(&stats.decodedFrames,
                           latest.targetFrame + committed,
                           __ATOMIC_RELEASE);
          closeDecoderState(previous);
          completed = true;
          actualFrame = latest.targetFrame;
          Serial.printf(
              "MEDIA SEEK MP3 COMMIT generation=%lu frame=%llu "
              "prefill=%u original_intact=until-commit\n",
              (unsigned long)latest.generation,
              (unsigned long long)actualFrame, (unsigned)committed);
        }
      }

      closeDecoderState(candidate);
      if (candidatePrefill) heap_caps_free(candidatePrefill);

      if (completed) break;
      if (stopRequested) break;
      if (haveReplacement) {
        Serial.printf(
            "MEDIA SEEK: superseded generation=%lu by generation=%lu "
            "target=%llu original_intact=yes\n",
            (unsigned long)latest.generation,
            (unsigned long)replacement.generation,
            (unsigned long long)replacement.targetFrame);
        latest = replacement;
        continue;
      }

      restored = true;
      actualFrame = originalFrame;
      Serial.printf(
          "MEDIA SEEK MP3 ROLLBACK generation=%lu reason=%s frame=%llu "
          "original_intact=yes terminal_error=no\n",
          (unsigned long)latest.generation,
          mp3SeekAttemptName(attempt.result),
          (unsigned long long)originalFrame);
      break;
    }
  } else {
    // Preserve the proven v12.1 WAV/FLAC in-place path unchanged.
    while (!stopRequested) {
      if (currentFile.totalFrames > 0) {
        latest.targetFrame = std::min<uint64_t>(
            latest.targetFrame, currentFile.totalFrames - 1);
      }

      resetRing();
      decoderComplete = false;
      bool heapBefore = heap_caps_check_integrity_all(true);
      updateTaskStackWatermark(true);
      bool seekOk =
          heapBefore &&
          seekDecoderToFrame(latest.targetFrame, latest.generation);
      if (stopRequested) break;
      updateTaskStackWatermark(true);
      bool heapAfter = heap_caps_check_integrity_all(true);
      seekOk = seekOk && heapAfter;

      SeekCommand replacement;
      if (xQueueReceive(seekCommandQueue, &replacement, 0) == pdTRUE) {
        Serial.printf(
            "MEDIA SEEK: superseded generation=%lu by generation=%lu "
            "target=%llu\n",
            (unsigned long)latest.generation,
            (unsigned long)replacement.generation,
            (unsigned long long)replacement.targetFrame);
        latest = replacement;
        continue;
      }

