CrawlingKingSn8ke/DSPi-ESP32-Front-Panel-Media-Player-SPDIF/firmware/DSPi_ESP32_Front_Panel_v1_1_2/MediaPlayerPoC.cpp
      if (seekOk) {
        __atomic_store_n(&stats.decodedFrames, latest.targetFrame,
                         __ATOMIC_RELEASE);
        __atomic_store_n(&stats.outputFrames, latest.targetFrame,
                         __ATOMIC_RELEASE);
        seekOk = prefillAfterSeek();
      }

      if (xQueueReceive(seekCommandQueue, &replacement, 0) == pdTRUE) {
        latest = replacement;
        continue;
      }

      if (seekOk) {
        completed = true;
        actualFrame = latest.targetFrame;
        break;
      }

      Serial.printf(
          "MEDIA SEEK: target failed generation=%lu target=%llu; "
          "restoring=%llu\n",
          (unsigned long)latest.generation,
          (unsigned long long)latest.targetFrame,
          (unsigned long long)originalFrame);
      resetRing();
      decoderComplete = false;
      restored = seekDecoderToFrame(originalFrame, latest.generation);
      if (restored) {
        __atomic_store_n(&stats.decodedFrames, originalFrame,
                         __ATOMIC_RELEASE);
        __atomic_store_n(&stats.outputFrames, originalFrame,
                         __ATOMIC_RELEASE);
        restored = prefillAfterSeek();
      }
      actualFrame = originalFrame;
      break;
    }
  }

  const uint32_t elapsed = millis() - startedAt;
  __atomic_store_n(&stats.lastSeekElapsedMs, elapsed, __ATOMIC_RELAXED);
  xEventGroupClearBits(mediaControlEvents,
                       kSeekActiveBit | kOutputQuiescentBit);

  if (stopRequested) {
    publishSeekEvent(MediaSeekResult::Cancelled, latest.targetFrame,
                     actualFrame, latest.generation, elapsed);
    return false;
  }

  if (completed) {
    __atomic_add_fetch(&stats.seekCompleted, 1U, __ATOMIC_RELAXED);
    state = seekResumePaused ? MediaPlaybackState::Paused
                             : MediaPlaybackState::Playing;
    Serial.printf(
        "MEDIA SEEK COMPLETE generation=%lu frame=%llu elapsed=%lu ms "
        "prefill=%u stack_free=%lu\n",
        (unsigned long)latest.generation,
        (unsigned long long)actualFrame, (unsigned long)elapsed,
        (unsigned)ringAvailable(),
        (unsigned long)uxTaskGetStackHighWaterMark(nullptr));
    publishSeekEvent(MediaSeekResult::Completed, latest.targetFrame,
                     actualFrame, latest.generation, elapsed);
    return true;
  }

  __atomic_add_fetch(&stats.seekFailed, 1U, __ATOMIC_RELAXED);
  if (restored) {
    state = seekResumePaused ? MediaPlaybackState::Paused
                             : MediaPlaybackState::Playing;
    strlcpy(errorText, "seek unavailable", sizeof(errorText));
    Serial.printf(
        "MEDIA SEEK FAILED generation=%lu restored=%llu elapsed=%lu ms\n",
        (unsigned long)latest.generation,
        (unsigned long long)actualFrame, (unsigned long)elapsed);
    publishSeekEvent(MediaSeekResult::Failed, latest.targetFrame,
                     actualFrame, latest.generation, elapsed);
    return false;
  }

  Serial.printf(
      "MEDIA SEEK FAILED generation=%lu restore-failed elapsed=%lu ms\n",
      (unsigned long)latest.generation, (unsigned long)elapsed);
  publishSeekEvent(MediaSeekResult::Failed, latest.targetFrame,
                   actualFrame, latest.generation, elapsed);
  setError("decoder seek and recovery failed");
  stopRequested = true;
  return false;
}

size_t MediaPlayerPoC::decodeFrames(int32_t *stereoOutput,
                                    size_t maximumFrames)
{
  if (!decoder || !stereoOutput || maximumFrames == 0) return 0;
  bool ioFault = false;
  size_t framesRead =
      decodeFramesFrom(*decoder, currentFile, stereoOutput, maximumFrames,
                       ioFault);
  if (ioFault) storageIoFault = true;
  return framesRead;
}

size_t MediaPlayerPoC::decodeFramesFrom(
    DecoderState &source, const MediaFileInfo &info, int32_t *stereoOutput,
    size_t maximumFrames, bool &ioFault)
{
  ioFault = false;
  if (!stereoOutput || maximumFrames == 0) return 0;
  maximumFrames = std::min(maximumFrames, kDecodeChunkFrames);

  const uint32_t decodeStartedAt = millis();
  size_t framesRead = 0;
  if (source.wavOpen) {
    framesRead = (size_t)drwav_read_pcm_frames_s32(
        &source.wav, maximumFrames, source.s32);
  } else if (source.flac) {
    framesRead = (size_t)drflac_read_pcm_frames_s32(
        source.flac, maximumFrames, source.s32);
  } else if (source.mp3Open) {
    framesRead = (size_t)drmp3_read_pcm_frames_s16(
        &source.mp3, maximumFrames, source.s16);
  }
  const uint32_t decodeElapsedMs = millis() - decodeStartedAt;
  updateAtomicMaximum(&stats.decoderCallMaxMs, decodeElapsedMs);
  __atomic_store_n(&stats.decoderLastCallMs, decodeElapsedMs,
                   __ATOMIC_RELEASE);
  if (decodeElapsedMs >= kSlowDecoderCallMs) {
    __atomic_add_fetch(&stats.decoderSlowCalls, 1U, __ATOMIC_RELAXED);
    __atomic_store_n(&stats.decoderLastSlowAtMs, millis(), __ATOMIC_RELEASE);
  }
  if (decodeElapsedMs >= kDecoderIoYieldIntervalMs) {
    vTaskDelay(1);
  }

  if (framesRead == 0 && source.file.hadIoError()) {
    ioFault = true;
  }

  if (info.format == MediaFileFormat::Mp3) {
    if (info.channels == 1) {
      for (size_t frame = 0; frame < framesRead; frame++) {
        int32_t sample = (int32_t)source.s16[frame] * 65536;
        stereoOutput[frame * 2] = sample;
        stereoOutput[frame * 2 + 1] = sample;
      }
    } else {
      for (size_t sample = 0; sample < framesRead * 2; sample++) {
        stereoOutput[sample] = (int32_t)source.s16[sample] * 65536;
      }
    }
  } else if (info.channels == 1) {
    for (size_t frame = 0; frame < framesRead; frame++) {
      int32_t sample = source.s32[frame];
      stereoOutput[frame * 2] = sample;
      stereoOutput[frame * 2 + 1] = sample;
    }
  } else if (framesRead) {
    memcpy(stereoOutput, source.s32,
           framesRead * 2 * sizeof(stereoOutput[0]));
  }
  return framesRead;
}

void MediaPlayerPoC::closeDecoderState(DecoderState *&target)
{
  if (!target) return;
  if (target->wavOpen) {
    drwav_uninit(&target->wav);
    target->wavOpen = false;
  }
  if (target->flac) {
    drflac_close(target->flac);
    target->flac = nullptr;
  }
  if (target->mp3Open) {
    drmp3_uninit(&target->mp3);
    target->mp3Open = false;
  }
  if (target->file) {
    SharedSpiGuard guard;
    target->file.close();
  }
  delete target;
  target = nullptr;
}

