CrawlingKingSn8ke/DSPi-ESP32-Front-Panel-Media-Player-SPDIF/firmware/DSPi_ESP32_Front_Panel_v1_1_2/MediaPlayerPoC.cpp
void MediaPlayerPoC::closeDecoder()
{
  closeDecoderState(decoder);
}

bool MediaPlayerPoC::allocateRing()
{
  // Keep the PSRAM ring for the lifetime of the media subsystem. Reusing the
  // same allocation avoids fragmentation and removes a large allocation from
  // every automatic track transition.
  if (pcmRing && ringFrameCapacity) {
    resetRing();
    return true;
  }
  freeRing();

  auto allocateFrames = [&](size_t frames) -> int32_t * {
    const size_t bytes = frames * 2 * sizeof(int32_t);
    return static_cast<int32_t *>(
        heap_caps_malloc(bytes, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));
  };

  pcmRing = allocateFrames(kPreferredRingFrames);
  ringFrameCapacity = pcmRing ? kPreferredRingFrames : 0;
  if (pcmRing) {
    const size_t words = ringFrameCapacity * 2;
    const size_t bytes = words * sizeof(int32_t);
    const uint32_t started = micros();
    for (size_t index = 0; index < words; index++) {
      pcmRing[index] = (int32_t)(0x5A5A0000U ^ (uint32_t)index);
    }
    volatile uint32_t checksum = 0;
    for (size_t index = 0; index < words; index++) {
      checksum ^= (uint32_t)pcmRing[index];
    }
    const uint32_t elapsedUs = std::max<uint32_t>(1, micros() - started);
    const uint64_t transferredBytes = (uint64_t)bytes * 2ULL;
    const uint32_t tenthsMiB = (uint32_t)(
        (transferredBytes * 10ULL * 1000000ULL) /
        ((uint64_t)elapsedUs * 1024ULL * 1024ULL));
    Serial.printf(
        "MEDIA RING: PSRAM test frames=%u bytes=%u bandwidth=%lu.%lu MiB/s checksum=%08lX\n",
        (unsigned)ringFrameCapacity, (unsigned)bytes,
        (unsigned long)(tenthsMiB / 10), (unsigned long)(tenthsMiB % 10),
        (unsigned long)checksum);
    if (tenthsMiB < kMinimumPsramBandwidthTenthsMiB) {
      Serial.printf(
          "MEDIA RING: preferred buffer below bandwidth floor %lu.%lu MiB/s; falling back\n",
          (unsigned long)(kMinimumPsramBandwidthTenthsMiB / 10),
          (unsigned long)(kMinimumPsramBandwidthTenthsMiB % 10));
      heap_caps_free(pcmRing);
      pcmRing = nullptr;
      ringFrameCapacity = 0;
    }
  }

  if (!pcmRing) {
    pcmRing = allocateFrames(kFallbackRingFrames);
    ringFrameCapacity = pcmRing ? kFallbackRingFrames : 0;
  }
  if (!pcmRing) {
    pcmRing = allocateFrames(kEmergencyRingFrames);
    ringFrameCapacity = pcmRing ? kEmergencyRingFrames : 0;
  }
  if (!pcmRing || ringFrameCapacity == 0) return false;

  memset(pcmRing, 0, ringFrameCapacity * 2 * sizeof(int32_t));
  resetRing();
  Serial.printf("MEDIA RING: selected=%u frames (%u bytes)\n",
                (unsigned)ringFrameCapacity,
                (unsigned)(ringFrameCapacity * 2 * sizeof(int32_t)));
  return true;
}

void MediaPlayerPoC::freeRing()
{
  if (pcmRing) {
    heap_caps_free(pcmRing);
    pcmRing = nullptr;
  }
  ringFrameCapacity = 0;
  resetRing();
}

size_t MediaPlayerPoC::ringAvailable() const
{
  uint32_t write = __atomic_load_n(&ringWriteCount, __ATOMIC_ACQUIRE);
  uint32_t read = __atomic_load_n(&ringReadCount, __ATOMIC_ACQUIRE);
  return (size_t)(write - read);
}

size_t MediaPlayerPoC::ringWritable() const
{
  if (ringFrameCapacity == 0) return 0;
  return ringFrameCapacity - ringAvailable();
}

size_t MediaPlayerPoC::writeRing(const int32_t *stereoInput, size_t frames)
{
  if (!pcmRing || !stereoInput || frames == 0 || ringFrameCapacity == 0) {
    return 0;
  }
  uint32_t write = __atomic_load_n(&ringWriteCount, __ATOMIC_RELAXED);
  uint32_t read = __atomic_load_n(&ringReadCount, __ATOMIC_ACQUIRE);
  size_t writable = ringFrameCapacity - (size_t)(write - read);
  frames = std::min(frames, writable);

  size_t index = write & (ringFrameCapacity - 1);
  size_t first = std::min(frames, ringFrameCapacity - index);
  memcpy(pcmRing + index * 2, stereoInput, first * 2 * sizeof(int32_t));
  if (frames > first) {
    memcpy(pcmRing, stereoInput + first * 2,
           (frames - first) * 2 * sizeof(int32_t));
  }
  __atomic_store_n(&ringWriteCount, write + (uint32_t)frames,
                   __ATOMIC_RELEASE);

  uint32_t fill = (uint32_t)((write + frames) - read);
  uint32_t highWater =
      __atomic_load_n(&stats.ringHighWaterFrames, __ATOMIC_RELAXED);
  while (fill > highWater &&
         !__atomic_compare_exchange_n(&stats.ringHighWaterFrames, &highWater,
                                      fill, false, __ATOMIC_RELAXED,
                                      __ATOMIC_RELAXED)) {
  }
  return frames;
}

size_t MediaPlayerPoC::readRing(int32_t *stereoOutput, size_t frames)
{
  if (!pcmRing || !stereoOutput || frames == 0 || ringFrameCapacity == 0) {
    return 0;
  }
  uint32_t read = __atomic_load_n(&ringReadCount, __ATOMIC_RELAXED);
  uint32_t write = __atomic_load_n(&ringWriteCount, __ATOMIC_ACQUIRE);
  frames = std::min(frames, (size_t)(write - read));

  size_t index = read & (ringFrameCapacity - 1);
  size_t first = std::min(frames, ringFrameCapacity - index);
  memcpy(stereoOutput, pcmRing + index * 2, first * 2 * sizeof(int32_t));
  if (frames > first) {
    memcpy(stereoOutput + first * 2, pcmRing,
           (frames - first) * 2 * sizeof(int32_t));
  }
  __atomic_store_n(&ringReadCount, read + (uint32_t)frames,
                   __ATOMIC_RELEASE);
  return frames;
}

bool MediaPlayerPoC::startSpdif(int8_t dataOutPin)
{
  stopSpdif();
  i2s_chan_config_t channelConfig =
      I2S_CHANNEL_DEFAULT_CONFIG(I2S_NUM_AUTO, I2S_ROLE_MASTER);
  channelConfig.dma_desc_num = 8;
  channelConfig.dma_frame_num = kOutputChunkFrames;
  channelConfig.auto_clear_after_cb = true;

  i2s_chan_handle_t tx = nullptr;
  if (i2s_new_channel(&channelConfig, &tx, nullptr) != ESP_OK) return false;

  i2s_std_config_t standardConfig = {};
  i2s_std_clk_config_t clockConfig =
      I2S_STD_CLK_DEFAULT_CONFIG(currentFile.sampleRate * 2u);
#if SOC_CLK_APLL_SUPPORTED
  clockConfig.clk_src = I2S_CLK_SRC_APLL;
#endif
  i2s_std_slot_config_t slotConfig =
      I2S_STD_MSB_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_32BIT,
                                     I2S_SLOT_MODE_STEREO);
  standardConfig.clk_cfg = clockConfig;
  standardConfig.slot_cfg = slotConfig;
  standardConfig.gpio_cfg.mclk = I2S_GPIO_UNUSED;
  standardConfig.gpio_cfg.bclk = I2S_GPIO_UNUSED;
  standardConfig.gpio_cfg.ws = I2S_GPIO_UNUSED;
  standardConfig.gpio_cfg.dout = (gpio_num_t)dataOutPin;
  standardConfig.gpio_cfg.din = I2S_GPIO_UNUSED;
  standardConfig.gpio_cfg.invert_flags.mclk_inv = false;
  standardConfig.gpio_cfg.invert_flags.bclk_inv = false;
  standardConfig.gpio_cfg.invert_flags.ws_inv = false;

  esp_err_t result = i2s_channel_init_std_mode(tx, &standardConfig);
  if (result == ESP_OK) result = i2s_channel_enable(tx);
  if (result != ESP_OK) {
    i2s_del_channel(tx);
    return false;
  }
  spdifTxChannel = tx;
  Serial.printf(
      "MEDIA SPDIF TX: enabled rate=%lu Hz carrier=%lu Hz data=GPIO%d "
      "depth=24-bit block-DMA\n",
      (unsigned long)currentFile.sampleRate,
      (unsigned long)(currentFile.sampleRate * 2u), dataOutPin);
  return true;
}

void MediaPlayerPoC::stopSpdif()
{
  if (!spdifTxChannel) return;
  i2s_chan_handle_t tx = static_cast<i2s_chan_handle_t>(spdifTxChannel);
  i2s_channel_disable(tx);
  i2s_del_channel(tx);
  spdifTxChannel = nullptr;
}

void MediaPlayerPoC::setError(const char *message)
{
  strlcpy(errorText, message ? message : "unknown media error",
          sizeof(errorText));
  state = MediaPlaybackState::Error;
  terminalEventPending = true;
}

bool MediaPlayerPoC::beginPlay(const char *path, int8_t dataOutPin,
                               MediaRouteCallback routeCallback,
                               void *routeContext, Stream &out)
{
  stop();
  if (decoderTaskHandle || outputTaskHandle) {
    out.printf("MEDIA PLAY: rejected path=%s reason=previous media task still stopping\n",
               path ? path : "(none)");
    return false;
  }
  if (!seekCommandQueue || !seekEventQueue || !mediaControlEvents) {
    setError("media control queues unavailable");
    out.printf("MEDIA PLAY: rejected path=%s reason=%s\n",
               path ? path : "(none)", errorText);
    return false;
  }

  xQueueReset(seekCommandQueue);
  xQueueReset(seekEventQueue);
  // Never clear kExternalHoldBit here. A preset/limit transaction may have
  // deliberately retained the hold after an ambiguous DSPi failure; starting a
  // new file must not silently release that safety barrier.
  xEventGroupClearBits(mediaControlEvents,
                       kSeekActiveBit | kOutputQuiescentBit);
  state = MediaPlaybackState::Starting;
  startStage = StartStage::Idle;
  stopRequested = false;
  decoderComplete = false;
  storageIoFault = false;
  terminalEventPending = false;
  seekResumePaused = false;
  seekGeneration = 0;
  stats = MediaPlaybackStats{};
  currentFile = MediaFileInfo{};
  currentPath[0] = '\0';
  errorText[0] = '\0';

  MediaFileInfo headerInfo;
  if (!cardMounted) {
    setError("SD card is not mounted");
  } else if (!path || !path[0] || !routeCallback) {
    setError("invalid playback request");
  } else if (!probeFile(path, headerInfo)) {
    setError("header probe failed");
  } else if (!headerInfo.nativeRateSupported) {
    char message[96];
    snprintf(message, sizeof(message),
             "unsupported sample rate %lu Hz; maximum supported is 48000",
             (unsigned long)headerInfo.sampleRate);
    setError(message);
  } else if ((headerInfo.channels != 1 && headerInfo.channels != 2) ||
             !sourceDepthSupported(headerInfo.format,
                                   headerInfo.bitsPerSample)) {
    setError("requires mono/stereo 16/24-bit WAV/FLAC or MP3");
  } else if (!openDecoder(path, currentFile)) {
    setError("decoder rejected the file");
  } else if (!allocateRing()) {
    closeDecoder();
    setError("PSRAM ring allocation failed");
  }

  if (state == MediaPlaybackState::Error) {
    startStage = StartStage::Idle;
    out.printf("MEDIA PLAY: rejected path=%s reason=%s\n",
               path ? path : "(null)", errorText);
    return false;
  }

  strlcpy(currentPath, path, sizeof(currentPath));
  startDataOutPin = dataOutPin;
  startRouteCallback = routeCallback;
  startRouteContext = routeContext;
  startPrefillTarget = std::min(kStartPrefillFrames,
                                ringFrameCapacity / 2);
  startStage = StartStage::Prefill;
  Serial.printf(
      "MEDIA START: prepared path=%s prefill-target=%u/%u chunks=cooperative\n",
      currentPath, (unsigned)startPrefillTarget,
      (unsigned)ringFrameCapacity);
  return true;
}

MediaStartStatus MediaPlayerPoC::servicePlayStart(Stream &out,
                                                  size_t decodeChunkBudget)
{
  if (state == MediaPlaybackState::Playing ||
      state == MediaPlaybackState::Paused) {
    return MediaStartStatus::Started;
  }
  if (state == MediaPlaybackState::Error) return MediaStartStatus::Failed;
  if (state != MediaPlaybackState::Starting ||
      startStage == StartStage::Idle) {
    return MediaStartStatus::Idle;
  }

  if (startStage == StartStage::Prefill) {
    size_t budget = std::max<size_t>(1, decodeChunkBudget);
    while (!stopRequested && budget-- &&
           ringAvailable() < startPrefillTarget && ringWritable() > 0) {
      size_t request = std::min(kDecodeChunkFrames, ringWritable());
      size_t frames = decodeFrames(decoder->stereo, request);
      if (frames == 0) {
        if (storageIoFault) {
          reportStorageReadFault("start-prefill");
          cardMounted = false;
          closeDecoder();
          resetRing();
          startStage = StartStage::Idle;
          setError("SD read failed or card removed");
          out.printf("MEDIA PLAY: failed path=%s reason=%s\n",
                     currentPath, errorText);
          return MediaStartStatus::Failed;
        }
        decoderComplete = true;
        break;
      }
      __atomic_add_fetch(&stats.decodedFrames, frames, __ATOMIC_RELAXED);
      if (writeRing(decoder->stereo, frames) != frames) {
        closeDecoder();
        resetRing();
        startStage = StartStage::Idle;
        setError("PCM prefill write failed");
        out.printf("MEDIA PLAY: failed path=%s reason=%s\n",
                   currentPath, errorText);
        return MediaStartStatus::Failed;
      }
    }

