CrawlingKingSn8ke/DSPi-ESP32-Front-Panel-Media-Player-SPDIF/firmware/DSPi_ESP32_Front_Panel_v1_1_2/MediaPlayerPoC.cpp
    if (ringAvailable() == 0 && decoderComplete) {
      closeDecoder();
      resetRing();
      startStage = StartStage::Idle;
      setError("decoder produced no PCM frames");
      out.printf("MEDIA PLAY: failed path=%s reason=%s\n",
                 currentPath, errorText);
      return MediaStartStatus::Failed;
    }

    if (ringAvailable() < startPrefillTarget && !decoderComplete) {
      return MediaStartStatus::Preparing;
    }

    out.printf("MEDIA PREFILL: %u/%u frames before route activation\n",
               (unsigned)ringAvailable(), (unsigned)ringFrameCapacity);
    startStage = StartStage::Activate;
    return MediaStartStatus::Preparing;
  }

  if (startStage != StartStage::Activate) {
    return MediaStartStatus::Preparing;
  }

  if (!startSpdif(startDataOutPin)) {
    closeDecoder();
    resetRing();
    startStage = StartStage::Idle;
    setError("ESP32 S/PDIF TX setup failed");
  } else if (!startRouteCallback ||
             !startRouteCallback(currentFile.sampleRate,
                                 startRouteContext)) {
    stopSpdif();
    closeDecoder();
    resetRing();
    startStage = StartStage::Idle;
    setError("DSPi S/PDIF route verification failed");
  }

  if (state == MediaPlaybackState::Error) {
    out.printf("MEDIA PLAY: failed path=%s reason=%s\n", currentPath,
               errorText);
    return MediaStartStatus::Failed;
  }

  state = MediaPlaybackState::Playing;
  startStage = StartStage::Idle;
  stats.ringLowWaterFrames = (uint32_t)ringAvailable();
  BaseType_t created = xTaskCreatePinnedToCore(
      decoderTaskEntry, "media-decode", kDecoderTaskStackBytes, this,
      kDecoderTaskPriority, &decoderTaskHandle, kDecoderTaskCore);
  if (created != pdPASS) {
    stop();
    setError("decoder task creation failed");
    out.printf("MEDIA PLAY: failed path=%s reason=%s\n", currentPath,
               errorText);
    return MediaStartStatus::Failed;
  }

  created = xTaskCreatePinnedToCore(
      outputTaskEntry, "media-spdif", 8192, this, kOutputTaskPriority,
      &outputTaskHandle, kOutputTaskCore);
  if (created != pdPASS) {
    stop();
    setError("S/PDIF output task creation failed");
    out.printf("MEDIA PLAY: failed path=%s reason=%s\n", currentPath,
               errorText);
    return MediaStartStatus::Failed;
  }

  startRouteCallback = nullptr;
  startRouteContext = nullptr;
  out.printf(
      "MEDIA PLAY: %s %lu Hz %u-bit %uch path=%s "
      "ring=%u frames in PSRAM decoder-stack=%lu bytes\n",
      formatName(currentFile.format), (unsigned long)currentFile.sampleRate,
      currentFile.bitsPerSample, currentFile.channels, currentPath,
      (unsigned)ringFrameCapacity, (unsigned long)kDecoderTaskStackBytes);
  return MediaStartStatus::Started;
}

bool MediaPlayerPoC::play(const char *path, int8_t dataOutPin,
                          MediaRouteCallback routeCallback,
                          void *routeContext, Stream &out)
{
  if (!beginPlay(path, dataOutPin,
                 routeCallback, routeContext, out)) {
    return false;
  }

  while (state == MediaPlaybackState::Starting) {
    MediaStartStatus status = servicePlayStart(out, 64);
    if (status == MediaStartStatus::Started) return true;
    if (status == MediaStartStatus::Failed ||
        status == MediaStartStatus::Idle) {
      return false;
    }
    delay(0);
  }
  return state == MediaPlaybackState::Playing ||
         state == MediaPlaybackState::Paused;
}

void MediaPlayerPoC::requestStop()
{
  const bool haveResources = decoderTaskHandle || outputTaskHandle || decoder ||
                             spdifTxChannel;
  if (state == MediaPlaybackState::Stopped && !haveResources) return;

  stopRequested = true;
  __atomic_add_fetch(&seekGeneration, 1U, __ATOMIC_ACQ_REL);
  state = MediaPlaybackState::Draining;
  if (decoderTaskHandle) xTaskNotifyGive(decoderTaskHandle);
  if (mediaControlEvents) {
    xEventGroupClearBits(mediaControlEvents,
                         kSeekActiveBit | kOutputQuiescentBit);
  }

  // When no task owns a resource, complete cleanup immediately. Otherwise the
  // main-loop transition state machine polls serviceStopCleanup() without
  // blocking the encoder, BLE processing or display service.
  if (!decoderTaskHandle && !outputTaskHandle) {
    serviceStopCleanup();
  }
}

void MediaPlayerPoC::stop()
{
  requestStop();

  // Synchronous Stop remains available for explicit user shutdown and legacy
  // call sites. Track changes use requestStop() and cooperative cleanup.
  unsigned long deadline = millis() + kTaskStopTimeoutMs;
  while ((decoderTaskHandle || outputTaskHandle) &&
         (long)(millis() - deadline) < 0) {
    delay(2);
  }

  if (decoderTaskHandle || outputTaskHandle) {
    strlcpy(errorText, "media task is still stopping", sizeof(errorText));
    state = MediaPlaybackState::Draining;
    Serial.printf("MEDIA STOP: timeout decoder=%s output=%s; cleanup deferred\n",
                  decoderTaskHandle ? "active" : "done",
                  outputTaskHandle ? "active" : "done");
    return;
  }
  serviceStopCleanup();
}

bool MediaPlayerPoC::serviceStopCleanup()
{
  if (decoderTaskHandle || outputTaskHandle) return false;
  if (state != MediaPlaybackState::Draining && !stopRequested) {
    return state == MediaPlaybackState::Stopped;
  }

  stopSpdif();
  closeDecoder();
  resetRing();
  if (seekCommandQueue) xQueueReset(seekCommandQueue);
  if (seekEventQueue) xQueueReset(seekEventQueue);
  if (mediaControlEvents) {
    xEventGroupClearBits(mediaControlEvents,
                         kSeekActiveBit | kOutputQuiescentBit);
  }
  stopRequested = false;
  decoderComplete = false;
  terminalEventPending = false;
  seekResumePaused = false;
  startStage = StartStage::Idle;
  startDataOutPin = -1;
  startRouteCallback = nullptr;
  startRouteContext = nullptr;
  startPrefillTarget = 0;
  state = MediaPlaybackState::Stopped;
  Serial.println("MEDIA STOP: deferred cleanup complete");
  return true;
}

bool MediaPlayerPoC::togglePause()
{
  if (state == MediaPlaybackState::Playing) {
    state = MediaPlaybackState::Paused;
    seekResumePaused = true;
    return true;
  }
  if (state == MediaPlaybackState::Paused) {
    state = MediaPlaybackState::Playing;
    seekResumePaused = false;
    return true;
  }
  if (state == MediaPlaybackState::Seeking) {
    seekResumePaused = !seekResumePaused;
    return true;
  }
  return false;
}

bool MediaPlayerPoC::requestSeek(uint64_t targetFrame)
{
  MediaPlaybackState current = state;
  if ((current != MediaPlaybackState::Playing &&
       current != MediaPlaybackState::Paused &&
       current != MediaPlaybackState::Seeking) ||
      !decoder || !decoderTaskHandle || !seekCommandQueue ||
      !mediaControlEvents) {
    return false;
  }

  if (currentFile.totalFrames > 0) {
    targetFrame = std::min<uint64_t>(targetFrame,
                                     currentFile.totalFrames - 1);
  }

  bool resumePaused = current == MediaPlaybackState::Paused ||
                      (current == MediaPlaybackState::Seeking &&
                       seekResumePaused);
  uint32_t generation =
      __atomic_add_fetch(&seekGeneration, 1U, __ATOMIC_ACQ_REL);
  SeekCommand command;
  command.targetFrame = targetFrame;
  command.generation = generation;
  command.resumePaused = resumePaused;
  if (xQueueOverwrite(seekCommandQueue, &command) != pdPASS) return false;

