CrawlingKingSn8ke/DSPi-ESP32-Front-Panel-Media-Player-SPDIF/firmware/DSPi_ESP32_Front_Panel_v1_1_2/MediaPlayerPoC.cpp
  seekResumePaused = resumePaused;
  state = MediaPlaybackState::Seeking;
  __atomic_add_fetch(&stats.seekRequests, 1U, __ATOMIC_RELAXED);
  xTaskNotifyGive(decoderTaskHandle);
  Serial.printf("MEDIA SEEK REQUEST generation=%lu target=%llu paused=%s\n",
                (unsigned long)generation,
                (unsigned long long)targetFrame,
                resumePaused ? "yes" : "no");
  return true;
}

bool MediaPlayerPoC::seeking() const
{
  return state == MediaPlaybackState::Seeking;
}

bool MediaPlayerPoC::takeSeekEvent(MediaSeekEvent &event)
{
  return seekEventQueue &&
         xQueueReceive(seekEventQueue, &event, 0) == pdTRUE;
}

bool MediaPlayerPoC::beginExternalHold(uint32_t timeoutMs)
{
  if (!active() || !outputTaskHandle || !mediaControlEvents) return true;
  if (seeking()) return false;

  // Include the quiesce handshake itself in the expected-control window. The
  // output task may already be inside a bounded DMA write when the bit is set.
  suppressSpdifTimeoutsUntil = millis() + timeoutMs + 250U;
  xEventGroupClearBits(mediaControlEvents, kOutputQuiescentBit);
  xEventGroupSetBits(mediaControlEvents, kExternalHoldBit);
  EventBits_t bits = xEventGroupWaitBits(
      mediaControlEvents, kOutputQuiescentBit, pdFALSE, pdTRUE,
      pdMS_TO_TICKS(timeoutMs));
  if ((bits & kOutputQuiescentBit) == 0) {
    xEventGroupClearBits(mediaControlEvents, kExternalHoldBit);
    suppressSpdifTimeoutsUntil = millis() + 100U;
    Serial.printf("MEDIA HOLD: quiesce timeout after %lu ms\n",
                  (unsigned long)timeoutMs);
    return false;
  }
  expectedHoldTimeouts = 0;
  Serial.println("MEDIA HOLD: output quiescent for DSP transaction");
  return true;
}

void MediaPlayerPoC::endExternalHold()
{
  if (!mediaControlEvents) return;
  // A DSPi control transaction can release immediately before the current
  // 25-ms DMA write returns. Keep a short grace window so that final expected
  // timeout is reported as transaction telemetry, not as an audio fault.
  suppressSpdifTimeoutsUntil = millis() + 300U;
  xEventGroupClearBits(mediaControlEvents, kExternalHoldBit);
  EventBits_t bits = xEventGroupGetBits(mediaControlEvents);
  if ((bits & kSeekActiveBit) == 0) {
    xEventGroupClearBits(mediaControlEvents, kOutputQuiescentBit);
  }
  uint32_t expected =
      __atomic_exchange_n(&expectedHoldTimeouts, 0U, __ATOMIC_ACQ_REL);
  Serial.printf("MEDIA HOLD: released expected_spdif_timeouts=%lu\n",
                (unsigned long)expected);
}

bool MediaPlayerPoC::externalHoldActive() const
{
  return mediaControlEvents &&
         (xEventGroupGetBits(mediaControlEvents) & kExternalHoldBit) != 0;
}

MediaPlaybackState MediaPlayerPoC::playbackState() const
{
  return state;
}

bool MediaPlayerPoC::active() const
{
  return state == MediaPlaybackState::Starting ||
         state == MediaPlaybackState::Playing ||
         state == MediaPlaybackState::Paused ||
         state == MediaPlaybackState::Seeking ||
         state == MediaPlaybackState::Draining;
}

bool MediaPlayerPoC::takeTerminalEvent(MediaPlaybackState &terminalState)
{
  if (!terminalEventPending) return false;
  terminalState = state;
  terminalEventPending = false;
  return terminalState == MediaPlaybackState::Finished ||
         terminalState == MediaPlaybackState::Error;
}

void MediaPlayerPoC::printPlaybackStatus(Stream &out) const
{
  MediaPlaybackStats snapshot = playbackStats();
  out.printf(
      "MEDIA STATUS: state=%s format=%s rate=%lu depth=%u channels=%u "
      "decoded=%llu output=%llu ring=%u/%u underrun=%lu events=%lu "
      "longest_underrun=%lu last_underrun_ms=%lu lowwater=%lu "
      "spdif_timeout=%lu spdif_error=%lu highwater=%lu "
      "dec_stack_free=%lu out_stack_free=%lu seek=%lu/%lu/%lu "
      "seek_ms=%lu sd_cb=%lu sd_slices=%lu sd_slow=%lu sd_err=%lu "
      "sd_yield=%lu cb_max_ms=%lu slice_max_ms=%lu "
      "spi_wait_max_ms=%lu sd_xfer_max_ms=%lu "
      "decode_max_ms=%lu decode_slow=%lu decode_last_ms=%lu "
      "last_decode_slow_ms=%lu ring_ms=%lu/%lu sd_clock=%lu path=%s",
      stateName(state), formatName(currentFile.format),
      (unsigned long)currentFile.sampleRate, currentFile.bitsPerSample,
      currentFile.channels, (unsigned long long)snapshot.decodedFrames,
      (unsigned long long)snapshot.outputFrames, (unsigned)ringAvailable(),
      (unsigned)ringFrameCapacity, (unsigned long)snapshot.underrunFrames,
      (unsigned long)snapshot.underrunEvents,
      (unsigned long)snapshot.longestUnderrunFrames,
      (unsigned long)snapshot.lastUnderrunAtMs,
      (unsigned long)snapshot.ringLowWaterFrames,
      (unsigned long)snapshot.spdifTimeouts,
      (unsigned long)snapshot.spdifErrors,
      (unsigned long)snapshot.ringHighWaterFrames,
      (unsigned long)snapshot.decoderStackMinFree,
      (unsigned long)snapshot.outputStackMinFree,
      (unsigned long)snapshot.seekRequests,
      (unsigned long)snapshot.seekCompleted,
      (unsigned long)snapshot.seekFailed,
      (unsigned long)snapshot.lastSeekElapsedMs,
      (unsigned long)snapshot.sdReadCalls,
      (unsigned long)snapshot.sdReadSlices,
      (unsigned long)snapshot.sdSlowReads,
      (unsigned long)snapshot.sdReadErrors,
      (unsigned long)snapshot.sdReadYields,
      (unsigned long)snapshot.sdReadMaxMs,
      (unsigned long)snapshot.sdReadSliceMaxMs,
      (unsigned long)snapshot.sdSpiWaitMaxMs,
      (unsigned long)snapshot.sdTransferMaxMs,
      (unsigned long)snapshot.decoderCallMaxMs,
      (unsigned long)snapshot.decoderSlowCalls,
      (unsigned long)snapshot.decoderLastCallMs,
      (unsigned long)snapshot.decoderLastSlowAtMs,
      currentFile.sampleRate
          ? (unsigned long)(((uint64_t)ringAvailable() * 1000ULL) /
                            currentFile.sampleRate)
          : 0UL,
      currentFile.sampleRate
          ? (unsigned long)(((uint64_t)ringFrameCapacity * 1000ULL) /
                            currentFile.sampleRate)
          : 0UL,
      (unsigned long)mountedFrequencyHz,
      currentPath[0] ? currentPath : "(none)");
  if (state == MediaPlaybackState::Error && errorText[0]) {
    out.printf(" error=%s", errorText);
  }
  out.println();
}

const char *MediaPlayerPoC::playbackPath() const
{
  return currentPath;
}

const char *MediaPlayerPoC::playbackError() const
{
  return errorText;
}

MediaFileInfo MediaPlayerPoC::playbackFile() const
{
  return currentFile;
}

MediaPlaybackStats MediaPlayerPoC::playbackStats() const
{
  MediaPlaybackStats snapshot;
  snapshot.decodedFrames =
      __atomic_load_n(&stats.decodedFrames, __ATOMIC_ACQUIRE);
  snapshot.outputFrames =
      __atomic_load_n(&stats.outputFrames, __ATOMIC_ACQUIRE);
  snapshot.underrunFrames =
      __atomic_load_n(&stats.underrunFrames, __ATOMIC_ACQUIRE);
  snapshot.underrunEvents =
      __atomic_load_n(&stats.underrunEvents, __ATOMIC_ACQUIRE);
  snapshot.longestUnderrunFrames =
      __atomic_load_n(&stats.longestUnderrunFrames, __ATOMIC_ACQUIRE);
  snapshot.lastUnderrunAtMs =
      __atomic_load_n(&stats.lastUnderrunAtMs, __ATOMIC_ACQUIRE);
  snapshot.spdifTimeouts =
      __atomic_load_n(&stats.spdifTimeouts, __ATOMIC_ACQUIRE);
  snapshot.spdifErrors =
      __atomic_load_n(&stats.spdifErrors, __ATOMIC_ACQUIRE);
  snapshot.ringHighWaterFrames =
      __atomic_load_n(&stats.ringHighWaterFrames, __ATOMIC_ACQUIRE);
  snapshot.ringLowWaterFrames =
      __atomic_load_n(&stats.ringLowWaterFrames, __ATOMIC_ACQUIRE);
  snapshot.decoderStackMinFree =
      __atomic_load_n(&stats.decoderStackMinFree, __ATOMIC_ACQUIRE);
  snapshot.outputStackMinFree =
      __atomic_load_n(&stats.outputStackMinFree, __ATOMIC_ACQUIRE);
  snapshot.seekRequests =
      __atomic_load_n(&stats.seekRequests, __ATOMIC_ACQUIRE);
  snapshot.seekCompleted =
      __atomic_load_n(&stats.seekCompleted, __ATOMIC_ACQUIRE);
  snapshot.seekFailed =
      __atomic_load_n(&stats.seekFailed, __ATOMIC_ACQUIRE);
  snapshot.lastSeekElapsedMs =
      __atomic_load_n(&stats.lastSeekElapsedMs, __ATOMIC_ACQUIRE);
  snapshot.sdReadCalls =
      __atomic_load_n(&stats.sdReadCalls, __ATOMIC_ACQUIRE);
  snapshot.sdReadSlices =
      __atomic_load_n(&stats.sdReadSlices, __ATOMIC_ACQUIRE);
  snapshot.sdSlowReads =
      __atomic_load_n(&stats.sdSlowReads, __ATOMIC_ACQUIRE);
  snapshot.sdReadErrors =
      __atomic_load_n(&stats.sdReadErrors, __ATOMIC_ACQUIRE);
  snapshot.sdReadYields =
      __atomic_load_n(&stats.sdReadYields, __ATOMIC_ACQUIRE);
  snapshot.sdReadMaxMs =
      __atomic_load_n(&stats.sdReadMaxMs, __ATOMIC_ACQUIRE);
  snapshot.sdReadSliceMaxMs =
      __atomic_load_n(&stats.sdReadSliceMaxMs, __ATOMIC_ACQUIRE);
  snapshot.sdSpiWaitMaxMs =
      __atomic_load_n(&stats.sdSpiWaitMaxMs, __ATOMIC_ACQUIRE);
  snapshot.sdTransferMaxMs =
      __atomic_load_n(&stats.sdTransferMaxMs, __ATOMIC_ACQUIRE);
  snapshot.decoderCallMaxMs =
      __atomic_load_n(&stats.decoderCallMaxMs, __ATOMIC_ACQUIRE);
  snapshot.decoderSlowCalls =
      __atomic_load_n(&stats.decoderSlowCalls, __ATOMIC_ACQUIRE);
  snapshot.decoderLastCallMs =
      __atomic_load_n(&stats.decoderLastCallMs, __ATOMIC_ACQUIRE);
  snapshot.decoderLastSlowAtMs =
      __atomic_load_n(&stats.decoderLastSlowAtMs, __ATOMIC_ACQUIRE);
  return snapshot;
}


size_t MediaPlayerPoC::bufferedFrames() const
{
  return ringAvailable();
}

