CrawlingKingSn8ke/DSPi-ESP32-Front-Panel-Media-Player-SPDIF/firmware/DSPi_ESP32_Front_Panel_v1_1_2/MediaPlayerPoC.cpp
size_t MediaPlayerPoC::ringCapacityFrames() const
{
  return ringFrameCapacity;
}


void MediaPlayerPoC::decoderTaskEntry(void *context)
{
  static_cast<MediaPlayerPoC *>(context)->decoderTask();
}

void MediaPlayerPoC::outputTaskEntry(void *context)
{
  static_cast<MediaPlayerPoC *>(context)->outputTask();
}

void MediaPlayerPoC::decoderTask()
{
  updateTaskStackWatermark(true);
  while (!stopRequested) {
    SeekCommand command;
    if (seekCommandQueue &&
        xQueueReceive(seekCommandQueue, &command, 0) == pdTRUE) {
      performSeek(command);
      updateTaskStackWatermark(true);
      continue;
    }

    if (decoderComplete) {
      ulTaskNotifyTake(pdTRUE, pdMS_TO_TICKS(20));
      continue;
    }

    size_t writable = ringWritable();
    if (writable < kDecodeChunkFrames) {
      ulTaskNotifyTake(pdTRUE, pdMS_TO_TICKS(2));
      continue;
    }

    size_t frames = decodeFrames(decoder->stereo, kDecodeChunkFrames);
    updateTaskStackWatermark(true);
    if (frames == 0) {
      if (storageIoFault && !stopRequested) {
        reportStorageReadFault("decoder");
        cardMounted = false;
        setError("SD read failed or card removed");
        stopRequested = true;
        Serial.printf("MEDIA SD: read fault path=%s; mount invalidated\n",
                      currentPath[0] ? currentPath : "(none)");
        break;
      }
      decoderComplete = true;
      continue;
    }
    __atomic_add_fetch(&stats.decodedFrames, frames, __ATOMIC_RELAXED);
    if (writeRing(decoder->stereo, frames) != frames) {
      setError("PCM ring write failed");
      stopRequested = true;
      break;
    }
  }

  closeDecoder();
  decoderComplete = true;
  decoderTaskHandle = nullptr;
  vTaskDelete(nullptr);
}

void MediaPlayerPoC::outputTask()
{
  int32_t output[kOutputChunkFrames * 2] = {};
  i2s_chan_handle_t tx = static_cast<i2s_chan_handle_t>(spdifTxChannel);
  constexpr size_t encodedWordCapacity =
      kOutputChunkFrames * SpdifBlockEncoder::kWordsPerStereoFrame;
  uint32_t *encoded = static_cast<uint32_t *>(heap_caps_malloc(
      encodedWordCapacity * sizeof(uint32_t),
      MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
  SpdifBlockEncoder encoder;
  encoder.reset();

  if (!encoded) {
    setError("S/PDIF DMA staging allocation failed");
    outputTaskHandle = nullptr;
    vTaskDelete(nullptr);
    return;
  }

  auto sendFrames = [&](const int32_t *samples, size_t frames) -> bool {
    if (!encoder.encode(samples, frames, encoded, encodedWordCapacity)) {
      __atomic_add_fetch(&stats.spdifErrors, 1U, __ATOMIC_RELAXED);
      setError("S/PDIF block encode failed");
      return false;
    }
    const uint8_t *next = reinterpret_cast<const uint8_t *>(encoded);
    size_t remaining = frames * SpdifBlockEncoder::kWordsPerStereoFrame *
                       sizeof(uint32_t);
    while (remaining && !stopRequested) {
      size_t written = 0;
      esp_err_t result = i2s_channel_write(tx, next, remaining, &written, 25);
      if (written) {
        next += written;
        remaining -= written;
      }
      if (result == ESP_ERR_TIMEOUT) {
        EventBits_t bits = mediaControlEvents
            ? xEventGroupGetBits(mediaControlEvents) : 0;
        const bool expectedControlTimeout =
            (bits & kExternalHoldBit) ||
            (int32_t)(millis() - suppressSpdifTimeoutsUntil) < 0;
        if (expectedControlTimeout) {
          __atomic_add_fetch(&expectedHoldTimeouts, 1U, __ATOMIC_RELAXED);
        } else {
          __atomic_add_fetch(&stats.spdifTimeouts, 1U, __ATOMIC_RELAXED);
        }
        continue;
      }
      if (result != ESP_OK) {
        __atomic_add_fetch(&stats.spdifErrors, 1U, __ATOMIC_RELAXED);
        setError("S/PDIF DMA write failed");
        return false;
      }
    }
    return !stopRequested;
  };

  bool naturalEnd = false;
  bool underrunActive = false;
  uint32_t underrunRunFrames = 0;
  updateTaskStackWatermark(false);

  // DSPi is switched to S/PDIF before this task starts. Give its receiver a
  // continuous quarter-second consumer-PCM silence stream to acquire lock
  // before consuming the first buffered music frame.
  size_t leadInFrames = currentFile.sampleRate / 4u;
  while (leadInFrames && !stopRequested) {
    const size_t frames = std::min(leadInFrames, kOutputChunkFrames);
    if (!sendFrames(nullptr, frames)) break;
    leadInFrames -= frames;
  }

  while (!stopRequested) {
    EventBits_t control = mediaControlEvents
        ? xEventGroupGetBits(mediaControlEvents) : 0;
    if (control & (kSeekActiveBit | kExternalHoldBit)) {
      xEventGroupSetBits(mediaControlEvents, kOutputQuiescentBit);
      if (!sendFrames(nullptr, kOutputChunkFrames)) break;
      updateTaskStackWatermark(false);
      continue;
    }
    if (mediaControlEvents) {
      EventBits_t remaining = xEventGroupGetBits(mediaControlEvents);
      if ((remaining & (kSeekActiveBit | kExternalHoldBit)) == 0) {
        xEventGroupClearBits(mediaControlEvents, kOutputQuiescentBit);
      }
    }

    if (state == MediaPlaybackState::Paused ||
        state == MediaPlaybackState::Seeking) {
      if (!sendFrames(nullptr, kOutputChunkFrames)) break;
      updateTaskStackWatermark(false);
      continue;
    }

    size_t frames = readRing(output, kOutputChunkFrames);
    if (frames == 0) {
      if (decoderComplete) {
        naturalEnd = true;
        break;
      }
      if (!underrunActive) {
        underrunActive = true;
        underrunRunFrames = 0;
        __atomic_add_fetch(&stats.underrunEvents, 1U, __ATOMIC_RELAXED);
      }
      underrunRunFrames += (uint32_t)kOutputChunkFrames;
      __atomic_add_fetch(&stats.underrunFrames,
                         (uint32_t)kOutputChunkFrames,
                         __ATOMIC_RELAXED);
      __atomic_store_n(&stats.lastUnderrunAtMs, millis(), __ATOMIC_RELAXED);
      updateAtomicMaximum(&stats.longestUnderrunFrames,
                          underrunRunFrames);
      if (!sendFrames(nullptr, kOutputChunkFrames)) break;
      updateTaskStackWatermark(false);
      continue;
    }

    underrunActive = false;
    underrunRunFrames = 0;
    if (!decoderComplete) {
      updateAtomicMinimum(&stats.ringLowWaterFrames,
                          (uint32_t)ringAvailable());
    }

    if (!sendFrames(output, frames)) break;
    __atomic_add_fetch(&stats.outputFrames, frames, __ATOMIC_RELAXED);
    updateTaskStackWatermark(false);
  }

  if (naturalEnd && !stopRequested &&
      state != MediaPlaybackState::Error) {
    state = MediaPlaybackState::Draining;
    size_t remaining = kTailSilenceFrames;
    while (remaining && !stopRequested) {
      size_t frames = std::min(remaining, kOutputChunkFrames);
      if (!sendFrames(nullptr, frames)) break;
      remaining -= frames;
    }
    if (!stopRequested && state != MediaPlaybackState::Error) {
      state = MediaPlaybackState::Finished;
      terminalEventPending = true;
    }
  }

  if (mediaControlEvents) {
    xEventGroupClearBits(mediaControlEvents, kOutputQuiescentBit);
  }
  free(encoded);
  outputTaskHandle = nullptr;
  vTaskDelete(nullptr);
}
